*** src/feedback/mod.rs:266:13: delete match arm "security" in FeedbackSanitizer::categorize_failure

*** mutation diff:
--- src/feedback/mod.rs
+++ delete match arm "security" in FeedbackSanitizer::categorize_failure
@@ -258,17 +258,17 @@
                 return FailureCategoryName::new("Server Error");
             }
             if step.error.as_ref().is_some_and(|e| e.contains("timeout")) {
                 return FailureCategoryName::new("Timeout");
             }
         }
 
         match result.category.as_str() {
-            "security" => FailureCategoryName::new("Security Violation"),
+             /* ~ changed by cargo-mutants ~ */
             "error-handling" => FailureCategoryName::new("Error Handling"),
             "happy-path" => FailureCategoryName::new("Happy Path"),
             _ => FailureCategoryName::new("Unknown"),
         }
     }
 
     fn sanitize_description(category: &FailureCategoryName) -> String {
         match category.as_str() {

*** result: Success
