*** src/bin/coverage.rs:31:9: delete match arm "json" in main

*** mutation diff:
--- src/bin/coverage.rs
+++ delete match arm "json" in main
@@ -23,20 +23,17 @@
 #[cfg(not(target_arch = "wasm32"))]
 fn main() -> Result<(), Box<dyn std::error::Error>> {
     let args = Args::parse();
 
     let analyzer = CoverageAnalyzer::new(&args.specs_dir, &args.scenarios_dir);
     let report = analyzer.analyze()?;
 
     match args.format.as_str() {
-        "json" => {
-            let json = serde_json::to_string_pretty(&report)?;
-            println!("{json}");
-        }
+         /* ~ changed by cargo-mutants ~ */
         "text" => {
             println!("Analyzing scenario coverage...");
             print_text_report(&report);
         }
         _ => {
             eprintln!("Unsupported format: {}", args.format);
             return Err("Use 'json' or 'text'".into());
         }

*** result: Success
