*** src/bin/quality-gate.rs:92:5: replace print_report with ()

*** mutation diff:
--- src/bin/quality-gate.rs
+++ replace print_report with ()
@@ -84,23 +84,17 @@
                 std::process::exit(1);
             }
         }
     }
 }
 
 #[cfg(not(target_arch = "wasm32"))]
 fn print_report(report: &LintReport) {
-    println!(
-        "Spec: {} v{} | Score: {}/100",
-        report.spec_id, report.spec_version, report.overall_score
-    );
-    for (cat, score) in &report.categories {
-        println!("  - {}: {} ({})", cat, score.score, score.details);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(target_arch = "wasm32"))]
 fn print_validation_results(results: &ValidationReport) {
     println!(
         "Report: {} | Total: {} | Passed: {} | Failed: {}",
         results.spec_id,
         results.total_scenarios,

*** result: Success
