*** src/coverage/mod.rs:115:50: replace > with < in CoverageAnalyzer::analyze

*** mutation diff:
--- src/coverage/mod.rs
+++ replace > with < in CoverageAnalyzer::analyze
@@ -107,17 +107,17 @@
         }
 
         let mut sorted_gaps: Vec<_> = gap_counts.into_iter().collect();
         sorted_gaps.sort_by_key(|b| std::cmp::Reverse(b.1));
         let common_gaps: Vec<String> = sorted_gaps.into_iter().take(10).map(|(s, _)| s).collect();
 
         Ok(CoverageReport {
             specs: spec_coverage,
-            overall_coverage: if total_behaviors > 0 {
+            overall_coverage: if total_behaviors < /* ~ changed by cargo-mutants ~ */ 0 {
                 #[allow(clippy::cast_precision_loss)]
                 {
                     covered_behaviors as f64 / total_behaviors as f64 * 100.0
                 }
             } else {
                 0.0
             },
             total_behaviors,

*** result: Success
