*** src/coverage/mod.rs:132:9: replace CoverageAnalyzer::find_spec_files -> Result<Vec<PathBuf>, CoverageError> with Ok(vec![])

*** mutation diff:
--- src/coverage/mod.rs
+++ replace CoverageAnalyzer::find_spec_files -> Result<Vec<PathBuf>, CoverageError> with Ok(vec![])
@@ -124,19 +124,17 @@
             total_edge_cases,
             covered_behaviors,
             covered_edge_cases,
             common_gaps,
         })
     }
 
     fn find_spec_files(&self) -> Result<Vec<PathBuf>, CoverageError> {
-        let mut specs = self.collect_yaml_files(&self.specs_dir)?;
-        specs.sort();
-        Ok(specs)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn collect_yaml_files(&self, root: &Path) -> Result<Vec<PathBuf>, CoverageError> {
         let mut files = Vec::new();
         if !root.exists() {
             return Ok(files);
         }

---- coverage::tests::given_duplicate_behavior_ids_when_analyzing_then_it_returns_typed_duplicate_error stdout ----

thread 'coverage::tests::given_duplicate_behavior_ids_when_analyzing_then_it_returns_typed_duplicate_error' (1664069) panicked at src/coverage/mod.rs:572:9:
assertion failed: matches!(result, Err(CoverageError::DuplicateBehaviorId { .. }))

---- coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered stdout ----

thread 'coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered' (1664071) panicked at src/coverage/mod.rs:495:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error stdout ----

thread 'coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error' (1664070) panicked at src/coverage/mod.rs:604:9:
assertion failed: matches!(result, Err(CoverageError::DuplicateEdgeCaseId { .. }))

failures:
    coverage::tests::given_duplicate_behavior_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_array_behaviors_shape_when_analyzing_then_it_returns_invalid_shape_error
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error
    coverage::tests::given_spec_without_identity_id_when_analyzing_then_i

test result: FAILED. 201 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
