*** src/coverage/mod.rs:138:9: replace CoverageAnalyzer::collect_yaml_files -> Result<Vec<PathBuf>, CoverageError> with Ok(vec![Default::default()])

*** mutation diff:
--- src/coverage/mod.rs
+++ replace CoverageAnalyzer::collect_yaml_files -> Result<Vec<PathBuf>, CoverageError> with Ok(vec![Default::default()])
@@ -130,46 +130,17 @@
 
     fn find_spec_files(&self) -> Result<Vec<PathBuf>, CoverageError> {
         let mut specs = self.collect_yaml_files(&self.specs_dir)?;
         specs.sort();
         Ok(specs)
     }
 
     fn collect_yaml_files(&self, root: &Path) -> Result<Vec<PathBuf>, CoverageError> {
-        let mut files = Vec::new();
-        if !root.exists() {
-            return Ok(files);
-        }
-
-        let mut stack = vec![root.to_path_buf()];
-        while let Some(dir) = stack.pop() {
-            for entry in fs::read_dir(&dir).map_err(|source| CoverageError::ReadDir {
-                path: dir.clone(),
-                source,
-            })? {
-                let path = entry
-                    .map_err(|source| CoverageError::ReadDir {
-                        path: dir.clone(),
-                        source,
-                    })?
-                    .path();
-                if path.is_dir() {
-                    stack.push(path);
-                } else if path
-                    .extension()
-                    .and_then(std::ffi::OsStr::to_str)
-                    .is_some_and(|ext| ext == "yaml" || ext == "yml")
-                {
-                    files.push(path);
-                }
-            }
-        }
-
-        Ok(files)
+        Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn normalize_spec_ref(value: &str) -> String {
         let normalized = value.trim().replace('\\', "/");
         let name = normalized
             .rsplit('/')
             .next()
             .map_or(normalized.as_str(), std::convert::identity);

---- coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered stdout ----
Error: ReadFile { path: "", source: Os { code: 2, kind: NotFound, message: "No such file or directory" } }

---- coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered stdout ----
Error: ReadFile { path: "", source: Os { code: 2, kind: NotFound, message: "No such file or directory" } }

---- coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive stdout ----
Error: ReadFile { path: "", source: Os { code: 2, kind: NotFound, message: "No such file or directory" } }

failures:
    coverage::tests::given_duplicate_behavior_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_array_behaviors_shape_when_analyzing_then_it_returns_invalid_shape_error
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error

test result: FAILED. 202 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
