*** src/coverage/mod.rs:139:12: delete ! in CoverageAnalyzer::collect_yaml_files

*** mutation diff:
--- src/coverage/mod.rs
+++ delete ! in CoverageAnalyzer::collect_yaml_files
@@ -131,17 +131,17 @@
     fn find_spec_files(&self) -> Result<Vec<PathBuf>, CoverageError> {
         let mut specs = self.collect_yaml_files(&self.specs_dir)?;
         specs.sort();
         Ok(specs)
     }
 
     fn collect_yaml_files(&self, root: &Path) -> Result<Vec<PathBuf>, CoverageError> {
         let mut files = Vec::new();
-        if !root.exists() {
+        if  /* ~ changed by cargo-mutants ~ */root.exists() {
             return Ok(files);
         }
 
         let mut stack = vec![root.to_path_buf()];
         while let Some(dir) = stack.pop() {
             for entry in fs::read_dir(&dir).map_err(|source| CoverageError::ReadDir {
                 path: dir.clone(),
                 source,

---- coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error stdout ----

thread 'coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error' (1682405) panicked at src/coverage/mod.rs:606:9:
assertion failed: matches!(result, Err(CoverageError::DuplicateEdgeCaseId { .. }))

---- coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered stdout ----

thread 'coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered' (1682407) panicked at src/coverage/mod.rs:521:32:
index out of bounds: the len is 0 but the index is 0

---- coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered stdout ----

thread 'coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered' (1682406) panicked at src/coverage/mod.rs:497:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coverage::tests::given_duplicate_behavior_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_array_behaviors_shape_when_analyzing_then_it_returns_invalid_shape_error
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error
    coverage::tests::given_spec_without_identity_id_when_analyzing_then_i

test result: FAILED. 201 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
