*** src/coverage/mod.rs:160:54: replace || with && in CoverageAnalyzer::collect_yaml_files

*** mutation diff:
--- src/coverage/mod.rs
+++ replace || with && in CoverageAnalyzer::collect_yaml_files
@@ -152,17 +152,17 @@
                         source,
                     })?
                     .path();
                 if path.is_dir() {
                     stack.push(path);
                 } else if path
                     .extension()
                     .and_then(std::ffi::OsStr::to_str)
-                    .is_some_and(|ext| ext == "yaml" || ext == "yml")
+                    .is_some_and(|ext| ext == "yaml" && /* ~ changed by cargo-mutants ~ */ ext == "yml")
                 {
                     files.push(path);
                 }
             }
         }
 
         Ok(files)
     }

---- coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized stdout ----

thread 'coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized' (1686317) panicked at src/coverage/mod.rs:724:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error stdout ----

thread 'coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error' (1686314) panicked at src/coverage/mod.rs:606:9:
assertion failed: matches!(result, Err(CoverageError::DuplicateEdgeCaseId { .. }))

---- coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive stdout ----

thread 'coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive' (1686318) panicked at src/coverage/mod.rs:690:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coverage::tests::given_duplicate_behavior_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_array_behaviors_shape_when_analyzing_then_it_returns_invalid_shape_error
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error
    coverage::tests::given_spec_without_identity_id_when_analyzing_then_i

test result: FAILED. 201 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
