*** src/coverage/mod.rs:160:61: replace == with != in CoverageAnalyzer::collect_yaml_files

*** mutation diff:
--- src/coverage/mod.rs
+++ replace == with != in CoverageAnalyzer::collect_yaml_files
@@ -152,17 +152,17 @@
                         source,
                     })?
                     .path();
                 if path.is_dir() {
                     stack.push(path);
                 } else if path
                     .extension()
                     .and_then(std::ffi::OsStr::to_str)
-                    .is_some_and(|ext| ext == "yaml" || ext == "yml")
+                    .is_some_and(|ext| ext == "yaml" || ext != /* ~ changed by cargo-mutants ~ */ "yml")
                 {
                     files.push(path);
                 }
             }
         }
 
         Ok(files)
     }

*** result: Success
