*** src/coverage/mod.rs:187:9: replace CoverageAnalyzer::analyze_spec -> Result<Option<SpecCoverage>, CoverageError> with Ok(None)

*** mutation diff:
--- src/coverage/mod.rs
+++ replace CoverageAnalyzer::analyze_spec -> Result<Option<SpecCoverage>, CoverageError> with Ok(None)
@@ -179,222 +179,17 @@
             .map_or(name, std::convert::identity);
 
         stem.strip_prefix("spec-")
             .map_or(stem, std::convert::identity)
             .to_lowercase()
     }
 
     fn analyze_spec(&self, spec_path: &Path) -> Result<Option<SpecCoverage>, CoverageError> {
-        let spec_path_buf = spec_path.to_path_buf();
-        let spec_content =
-            fs::read_to_string(spec_path).map_err(|source| CoverageError::ReadFile {
-                path: spec_path_buf.clone(),
-                source,
-            })?;
-        let yaml: Value =
-            serde_yaml::from_str(&spec_content).map_err(|source| CoverageError::MalformedYaml {
-                path: spec_path_buf.clone(),
-                source,
-            })?;
-
-        if yaml.get("specification").is_none() {
-            return Ok(None);
-        }
-
-        let spec_id = yaml
-            .get("specification")
-            .and_then(|value| value.get("identity"))
-            .and_then(|value| value.get("id"))
-            .and_then(serde_yaml::Value::as_str)
-            .ok_or_else(|| CoverageError::InvalidSpecShape {
-                path: spec_path_buf.clone(),
-                detail: "missing specification.identity.id".to_string(),
-            })?
-            .trim()
-            .to_string();
-
-        if spec_id.is_empty() {
-            return Err(CoverageError::InvalidSpecShape {
-                path: spec_path_buf.clone(),
-                detail: "specification.identity.id must be a non-empty string".to_string(),
-            });
-        }
-
-        let mut behavior_ids: HashSet<String> = HashSet::new();
-        let mut edge_case_ids: HashSet<String> = HashSet::new();
-        let Some(specification) = yaml.get("specification") else {
-            return Ok(None);
-        };
-
-        let behaviors = specification
-            .get("behaviors")
-            .and_then(serde_yaml::Value::as_sequence)
-            .ok_or_else(|| CoverageError::InvalidSpecShape {
-                path: spec_path_buf.clone(),
-                detail: "specification.behaviors must be an array".to_string(),
-            })?;
-
-        for behavior in behaviors {
-            let behavior_map =
-                behavior
-                    .as_mapping()
-                    .ok_or_else(|| CoverageError::InvalidSpecShape {
-                        path: spec_path_buf.clone(),
-                        detail: "each behavior must be an object".to_string(),
-                    })?;
-
-            let behavior_id = behavior_map
-                .get(Value::String("id".to_string()))
-                .and_then(serde_yaml::Value::as_str)
-                .map(str::trim)
-                .filter(|id| !id.is_empty())
-                .ok_or_else(|| CoverageError::InvalidSpecShape {
-                    path: spec_path_buf.clone(),
-                    detail: "each behavior must include a non-empty string id".to_string(),
-                })?
-                .to_string();
-
-            if !behavior_ids.insert(behavior_id.clone()) {
-                return Err(CoverageError::DuplicateBehaviorId {
-                    path: spec_path_buf.clone(),
-                    id: behavior_id,
-                });
-            }
-
-            if let Some(edge_cases_value) =
-                behavior_map.get(Value::String("edge_cases".to_string()))
-            {
-                let edge_cases = edge_cases_value.as_sequence().ok_or_else(|| {
-                    CoverageError::InvalidSpecShape {
-                        path: spec_path_buf.clone(),
-                        detail: "behavior.edge_cases must be an array when provided".to_string(),
-                    }
-                })?;
-
-                for edge_case in edge_cases {
-                    let edge_map =
-                        edge_case
-                            .as_mapping()
-                            .ok_or_else(|| CoverageError::InvalidSpecShape {
-                                path: spec_path_buf.clone(),
-                                detail: "each edge case must be an object".to_string(),
-                            })?;
-
-                    let edge_case_id = edge_map
-                        .get(Value::String("id".to_string()))
-                        .and_then(serde_yaml::Value::as_str)
-                        .map(str::trim)
-                        .filter(|id| !id.is_empty())
-                        .ok_or_else(|| CoverageError::InvalidSpecShape {
-                            path: spec_path_buf.clone(),
-                            detail: "each edge case must include a non-empty string id".to_string(),
-                        })?
-                        .to_string();
-
-                    if !edge_case_ids.insert(edge_case_id.clone()) {
-                        return Err(CoverageError::DuplicateEdgeCaseId {
-                            path: spec_path_buf.clone(),
-                            id: edge_case_id,
-                        });
-                    }
-                }
-            }
-        }
-
-        let mut scenario_behavior_ids: HashSet<String> = HashSet::new();
-        let mut scenario_edge_case_ids: HashSet<String> = HashSet::new();
-
-        for (scenario, scenario_path) in self.find_scenarios_for_spec(&spec_id)? {
-            let steps = scenario
-                .get("steps")
-                .and_then(serde_yaml::Value::as_sequence)
-                .or_else(|| {
-                    scenario
-                        .get("scenario")
-                        .and_then(|inner| inner.get("steps"))
-                        .and_then(serde_yaml::Value::as_sequence)
-                });
-
-            if let Some(steps) = steps {
-                for step in steps {
-                    if let Some(assertions_value) = step.get("assertions") {
-                        let assertions = assertions_value.as_sequence().ok_or_else(|| {
-                            CoverageError::InvalidSpecShape {
-                                path: scenario_path.clone(),
-                                detail: "scenario step assertions must be an array".to_string(),
-                            }
-                        })?;
-
-                        for assertion in assertions {
-                            if let Some(behavior_ref_value) = assertion.get("behavior_ref") {
-                                let behavior_ref = behavior_ref_value
-                                    .as_str()
-                                    .map(str::trim)
-                                    .filter(|reference| !reference.is_empty())
-                                    .ok_or_else(|| CoverageError::MalformedReference {
-                                        path: scenario_path.clone(),
-                                        detail: "behavior_ref must be a non-empty string"
-                                            .to_string(),
-                                    })?;
-
-                                let _ = scenario_behavior_ids.insert(behavior_ref.to_string());
-                            }
-
-                            if let Some(edge_case_ref_value) = assertion.get("edge_case_ref") {
-                                let edge_case_ref = edge_case_ref_value
-                                    .as_str()
-                                    .map(str::trim)
-                                    .filter(|reference| !reference.is_empty())
-                                    .ok_or_else(|| CoverageError::MalformedReference {
-                                        path: scenario_path.clone(),
-                                        detail: "edge_case_ref must be a non-empty string"
-                                            .to_string(),
-                                    })?;
-
-                                let _ = scenario_edge_case_ids.insert(edge_case_ref.to_string());
-                            }
-                        }
-                    }
-                }
-            }
-        }
-
-        let covered_behaviors = behavior_ids.intersection(&scenario_behavior_ids).count();
-        let covered_edge_cases = edge_case_ids.intersection(&scenario_edge_case_ids).count();
-
-        let mut missing_behaviors: Vec<String> = behavior_ids
-            .difference(&scenario_behavior_ids)
-            .cloned()
-            .collect();
-        missing_behaviors.sort();
-
-        let mut missing_edge_cases: Vec<String> = edge_case_ids
-            .difference(&scenario_edge_case_ids)
-            .cloned()
-            .collect();
-        missing_edge_cases.sort();
-
-        Ok(Some(SpecCoverage {
-            spec_id,
-            total_behaviors: behavior_ids.len(),
-            covered_behaviors,
-            total_edge_cases: edge_case_ids.len(),
-            covered_edge_cases,
-            coverage_percentage: if behavior_ids.is_empty() {
-                0.0
-            } else {
-                #[allow(clippy::cast_precision_loss)]
-                {
-                    covered_behaviors as f64 / behavior_ids.len() as f64 * 100.0
-                }
-            },
-            missing_behaviors,
-            missing_edge_cases,
-        }))
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     fn find_scenarios_for_spec(
         &self,
         spec_id: &str,
     ) -> Result<Vec<(Value, PathBuf)>, CoverageError> {
         let mut scenarios = Vec::new();
         let normalized_spec_id = Self::normalize_spec_ref(spec_id);

---- coverage::tests::given_spec_without_identity_id_when_analyzing_then_it_returns_error stdout ----

thread 'coverage::tests::given_spec_without_identity_id_when_analyzing_then_it_returns_error' (1706432) panicked at src/coverage/mod.rs:342:9:
assertion failed: result.is_err()

---- coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered stdout ----

thread 'coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered' (1706426) panicked at src/coverage/mod.rs:292:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized stdout ----

thread 'coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized' (1706428) panicked at src/coverage/mod.rs:519:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coverage::tests::given_duplicate_behavior_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_array_behaviors_shape_when_analyzing_then_it_returns_invalid_shape_error
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error
    coverage::tests::given_spec_without_identity_id_when_analyzing_then_i

test result: FAILED. 201 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
