*** src/coverage/mod.rs:249:30: delete ! in CoverageAnalyzer::analyze_spec

*** mutation diff:
--- src/coverage/mod.rs
+++ delete ! in CoverageAnalyzer::analyze_spec
@@ -241,17 +241,17 @@
                         path: spec_path_buf.clone(),
                         detail: "each behavior must be an object".to_string(),
                     })?;
 
             let behavior_id = behavior_map
                 .get(Value::String("id".to_string()))
                 .and_then(serde_yaml::Value::as_str)
                 .map(str::trim)
-                .filter(|id| !id.is_empty())
+                .filter(|id|  /* ~ changed by cargo-mutants ~ */id.is_empty())
                 .ok_or_else(|| CoverageError::InvalidSpecShape {
                     path: spec_path_buf.clone(),
                     detail: "each behavior must include a non-empty string id".to_string(),
                 })?
                 .to_string();
 
             if !behavior_ids.insert(behavior_id.clone()) {
                 return Err(CoverageError::DuplicateBehaviorId {

---- coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized stdout ----
Error: InvalidSpecShape { path: "/tmp/oya-coverage-normalized-ref-1774852212894228857/specs/spec.yaml", detail: "each behavior must include a non-empty string id" }

---- coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered stdout ----
Error: InvalidSpecShape { path: "/tmp/oya-coverage-edge-case-1774852212894194497/specs/spec.yaml", detail: "each behavior must include a non-empty string id" }

---- coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered stdout ----
Error: InvalidSpecShape { path: "/tmp/oya-coverage-behavior-1774852212894183507/specs/spec.yaml", detail: "each behavior must include a non-empty string id" }

failures:
    coverage::tests::given_duplicate_behavior_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error

test result: FAILED. 203 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
