*** src/coverage/mod.rs:256:16: delete ! in CoverageAnalyzer::analyze_spec

*** mutation diff:
--- src/coverage/mod.rs
+++ delete ! in CoverageAnalyzer::analyze_spec
@@ -248,17 +248,17 @@
                 .map(str::trim)
                 .filter(|id| !id.is_empty())
                 .ok_or_else(|| CoverageError::InvalidSpecShape {
                     path: spec_path_buf.clone(),
                     detail: "each behavior must include a non-empty string id".to_string(),
                 })?
                 .to_string();
 
-            if !behavior_ids.insert(behavior_id.clone()) {
+            if  /* ~ changed by cargo-mutants ~ */behavior_ids.insert(behavior_id.clone()) {
                 return Err(CoverageError::DuplicateBehaviorId {
                     path: spec_path_buf.clone(),
                     id: behavior_id,
                 });
             }
 
             if let Some(edge_cases_value) =
                 behavior_map.get(Value::String("edge_cases".to_string()))

---- coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered stdout ----
Error: DuplicateBehaviorId { path: "/tmp/oya-coverage-edge-case-1774852216263268613/specs/spec.yaml", id: "behavior-1" }

---- coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized stdout ----
Error: DuplicateBehaviorId { path: "/tmp/oya-coverage-normalized-ref-1774852216263301372/specs/spec.yaml", id: "behavior-1" }

---- coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive stdout ----
Error: DuplicateBehaviorId { path: "/tmp/oya-coverage-recursive-discovery-1774852216263345162/specs/nested/spec.yaml", id: "behavior-1" }

failures:
    coverage::tests::given_duplicate_edge_case_ids_when_analyzing_then_it_returns_typed_duplicate_error
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error

test result: FAILED. 204 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
