*** src/coverage/mod.rs:293:24: delete ! in CoverageAnalyzer::analyze_spec

*** mutation diff:
--- src/coverage/mod.rs
+++ delete ! in CoverageAnalyzer::analyze_spec
@@ -285,17 +285,17 @@
                         .map(str::trim)
                         .filter(|id| !id.is_empty())
                         .ok_or_else(|| CoverageError::InvalidSpecShape {
                             path: spec_path_buf.clone(),
                             detail: "each edge case must include a non-empty string id".to_string(),
                         })?
                         .to_string();
 
-                    if !edge_case_ids.insert(edge_case_id.clone()) {
+                    if  /* ~ changed by cargo-mutants ~ */edge_case_ids.insert(edge_case_id.clone()) {
                         return Err(CoverageError::DuplicateEdgeCaseId {
                             path: spec_path_buf.clone(),
                             id: edge_case_id,
                         });
                     }
                 }
             }
         }

---- coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered stdout ----
Error: DuplicateEdgeCaseId { path: "/tmp/oya-coverage-behavior-1774852222882903889/specs/spec.yaml", id: "edge-1" }

---- coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive stdout ----
Error: DuplicateEdgeCaseId { path: "/tmp/oya-coverage-recursive-discovery-1774852222882964788/specs/nested/spec.yaml", id: "edge-1" }

---- coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered stdout ----
Error: DuplicateEdgeCaseId { path: "/tmp/oya-coverage-edge-case-1774852222882949268/specs/spec.yaml", id: "edge-1" }

failures:
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error

test result: FAILED. 206 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
