*** src/coverage/mod.rs:332:57: delete ! in CoverageAnalyzer::analyze_spec

*** mutation diff:
--- src/coverage/mod.rs
+++ delete ! in CoverageAnalyzer::analyze_spec
@@ -324,17 +324,17 @@
                             }
                         })?;
 
                         for assertion in assertions {
                             if let Some(behavior_ref_value) = assertion.get("behavior_ref") {
                                 let behavior_ref = behavior_ref_value
                                     .as_str()
                                     .map(str::trim)
-                                    .filter(|reference| !reference.is_empty())
+                                    .filter(|reference|  /* ~ changed by cargo-mutants ~ */reference.is_empty())
                                     .ok_or_else(|| CoverageError::MalformedReference {
                                         path: scenario_path.clone(),
                                         detail: "behavior_ref must be a non-empty string"
                                             .to_string(),
                                     })?;
 
                                 let _ = scenario_behavior_ids.insert(behavior_ref.to_string());
                             }

---- coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered stdout ----
Error: MalformedReference { path: "/tmp/oya-coverage-edge-case-1774852226189734756/scenarios/scenario.yaml", detail: "behavior_ref must be a non-empty string" }

---- coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized stdout ----
Error: MalformedReference { path: "/tmp/oya-coverage-normalized-ref-1774852226189773966/scenarios/scenario.yaml", detail: "behavior_ref must be a non-empty string" }

---- coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered stdout ----
Error: MalformedReference { path: "/tmp/oya-coverage-behavior-1774852226189729496/scenarios/scenario.yaml", detail: "behavior_ref must be a non-empty string" }

failures:
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive

test result: FAILED. 206 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
