*** src/coverage/mod.rs:399:9: replace CoverageAnalyzer::find_scenarios_for_spec -> Result<Vec<(Value, PathBuf)>, CoverageError> with Ok(vec![(Default::default(), Default::default())])

*** mutation diff:
--- src/coverage/mod.rs
+++ replace CoverageAnalyzer::find_scenarios_for_spec -> Result<Vec<(Value, PathBuf)>, CoverageError> with Ok(vec![(Default::default(), Default::default())])
@@ -391,41 +391,17 @@
             missing_edge_cases,
         }))
     }
 
     fn find_scenarios_for_spec(
         &self,
         spec_id: &str,
     ) -> Result<Vec<(Value, PathBuf)>, CoverageError> {
-        let mut scenarios = Vec::new();
-        let normalized_spec_id = Self::normalize_spec_ref(spec_id);
-
-        for path in self.collect_yaml_files(&self.scenarios_dir)? {
-            let content = fs::read_to_string(&path).map_err(|source| CoverageError::ReadFile {
-                path: path.clone(),
-                source,
-            })?;
-            let yaml = serde_yaml::from_str::<Value>(&content).map_err(|source| {
-                CoverageError::MalformedYaml {
-                    path: path.clone(),
-                    source,
-                }
-            })?;
-
-            if let Some(scenario) = yaml.get("scenario") {
-                if let Some(ref_str) = scenario.get("spec_ref").and_then(Value::as_str) {
-                    let normalized_ref = Self::normalize_spec_ref(ref_str);
-                    if normalized_ref == normalized_spec_id {
-                        scenarios.push((yaml, path.clone()));
-                    }
-                }
-            }
-        }
-        Ok(scenarios)
+        Ok(vec![(Default::default(), Default::default())]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::fs;
     use std::time::{SystemTime, UNIX_EPOCH};

---- coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered stdout ----

thread 'coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered' (1754528) panicked at src/coverage/mod.rs:474:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered stdout ----

thread 'coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered' (1754529) panicked at src/coverage/mod.rs:497:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive stdout ----

thread 'coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive' (1754531) panicked at src/coverage/mod.rs:667:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error

test result: FAILED. 205 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
