*** src/coverage/mod.rs:417:39: replace == with != in CoverageAnalyzer::find_scenarios_for_spec

*** mutation diff:
--- src/coverage/mod.rs
+++ replace == with != in CoverageAnalyzer::find_scenarios_for_spec
@@ -409,17 +409,17 @@
                     path: path.clone(),
                     source,
                 }
             })?;
 
             if let Some(scenario) = yaml.get("scenario") {
                 if let Some(ref_str) = scenario.get("spec_ref").and_then(Value::as_str) {
                     let normalized_ref = Self::normalize_spec_ref(ref_str);
-                    if normalized_ref == normalized_spec_id {
+                    if normalized_ref != /* ~ changed by cargo-mutants ~ */ normalized_spec_id {
                         scenarios.push((yaml, path.clone()));
                     }
                 }
             }
         }
         Ok(scenarios)
     }
 }

---- coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized stdout ----

thread 'coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized' (1758575) panicked at src/coverage/mod.rs:725:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered stdout ----

thread 'coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered' (1758574) panicked at src/coverage/mod.rs:521:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive stdout ----

thread 'coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive' (1758576) panicked at src/coverage/mod.rs:691:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    coverage::tests::given_matching_behavior_ref_when_analyzing_then_behavior_is_counted_as_covered
    coverage::tests::given_matching_edge_case_ref_when_analyzing_then_edge_case_is_counted_as_covered
    coverage::tests::given_mixed_spec_ref_formats_when_analyzing_then_refs_are_normalized
    coverage::tests::given_nested_spec_and_scenario_dirs_when_analyzing_then_discovery_is_recursive
    coverage::tests::given_non_string_behavior_reference_when_analyzing_then_it_returns_malformed_reference_error

test result: FAILED. 205 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
