*** src/dashboard/mod.rs:120:5: replace format_status -> &'static str with ""

*** mutation diff:
--- src/dashboard/mod.rs
+++ replace format_status -> &'static str with ""
@@ -112,22 +112,17 @@
     println!("  RECENT SESSIONS");
     println!("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
     println!();
     println!("  (Session listing currently limited to summary view)");
 }
 
 #[must_use]
 pub const fn format_status(status: &SessionStatus) -> &'static str {
-    match status {
-        SessionStatus::Passed => "✓",
-        SessionStatus::Failed => "✗",
-        SessionStatus::Escalated => "!",
-        SessionStatus::InProgress => "→",
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 /// Export metrics to a file.
 ///
 /// # Errors
 /// Returns an error if writing to the output file fails.
 pub fn export_metrics(
     store: &MetricsStore,

*** result: Success
