*** src/dashboard/mod.rs:137:5: replace export_metrics -> Result<(), Box<dyn std::error::Error>> with Ok(())

*** mutation diff:
--- src/dashboard/mod.rs
+++ replace export_metrics -> Result<(), Box<dyn std::error::Error>> with Ok(())
@@ -129,28 +129,17 @@
 ///
 /// # Errors
 /// Returns an error if writing to the output file fails.
 pub fn export_metrics(
     store: &MetricsStore,
     format: &str,
     output: &Path,
 ) -> Result<(), Box<dyn std::error::Error>> {
-    let summary = store.get_summary();
-
-    let report = match format {
-        "json" => serde_json::to_string_pretty(&summary)?,
-        "text" => format_text_summary(&summary),
-        _ => return Err("Unsupported format".into()),
-    };
-
-    std::fs::write(output, report)?;
-
-    println!("✅ Exported metrics to {}", output.display());
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn format_text_summary(summary: &crate::metrics::MetricsSummary) -> String {
     let total = summary.total_sessions;
     let passed_pct = if total > 0 {
         #[allow(clippy::cast_precision_loss)]
         {
             summary.passed_sessions as f64 / total as f64 * 100.0

*** result: Success
