*** src/dashboard/mod.rs:141:9: delete match arm "text" in export_metrics

*** mutation diff:
--- src/dashboard/mod.rs
+++ delete match arm "text" in export_metrics
@@ -133,17 +133,17 @@
     store: &MetricsStore,
     format: &str,
     output: &Path,
 ) -> Result<(), Box<dyn std::error::Error>> {
     let summary = store.get_summary();
 
     let report = match format {
         "json" => serde_json::to_string_pretty(&summary)?,
-        "text" => format_text_summary(&summary),
+         /* ~ changed by cargo-mutants ~ */
         _ => return Err("Unsupported format".into()),
     };
 
     std::fs::write(output, report)?;
 
     println!("✅ Exported metrics to {}", output.display());
     Ok(())
 }

*** result: Success
