*** src/dashboard/mod.rs:153:31: replace > with == in format_text_summary

*** mutation diff:
--- src/dashboard/mod.rs
+++ replace > with == in format_text_summary
@@ -145,17 +145,17 @@
     std::fs::write(output, report)?;
 
     println!("✅ Exported metrics to {}", output.display());
     Ok(())
 }
 
 fn format_text_summary(summary: &crate::metrics::MetricsSummary) -> String {
     let total = summary.total_sessions;
-    let passed_pct = if total > 0 {
+    let passed_pct = if total == /* ~ changed by cargo-mutants ~ */ 0 {
         #[allow(clippy::cast_precision_loss)]
         {
             summary.passed_sessions as f64 / total as f64 * 100.0
         }
     } else {
         0.0
     };
     let failed_pct = if total > 0 {

*** result: Success
