*** src/dashboard/mod.rs:156:59: replace * with / in format_text_summary

*** mutation diff:
--- src/dashboard/mod.rs
+++ replace * with / in format_text_summary
@@ -148,17 +148,17 @@
     Ok(())
 }
 
 fn format_text_summary(summary: &crate::metrics::MetricsSummary) -> String {
     let total = summary.total_sessions;
     let passed_pct = if total > 0 {
         #[allow(clippy::cast_precision_loss)]
         {
-            summary.passed_sessions as f64 / total as f64 * 100.0
+            summary.passed_sessions as f64 / total as f64 / /* ~ changed by cargo-mutants ~ */ 100.0
         }
     } else {
         0.0
     };
     let failed_pct = if total > 0 {
         #[allow(clippy::cast_precision_loss)]
         {
             summary.failed_sessions as f64 / total as f64 * 100.0

*** result: Success
