*** src/dashboard/mod.rs:38:5: replace run -> Result<(), Box<dyn std::error::Error>> with Ok(())

*** mutation diff:
--- src/dashboard/mod.rs
+++ replace run -> Result<(), Box<dyn std::error::Error>> with Ok(())
@@ -30,38 +30,17 @@
     },
 }
 
 /// Run the dashboard application.
 ///
 /// # Errors
 /// Returns an error if metrics export fails.
 pub fn run(args: Args) -> Result<(), Box<dyn std::error::Error>> {
-    let metrics_store = MetricsStore::new(&PathBuf::from("."));
-
-    match args.command {
-        Commands::Summary => {
-            let summary = metrics_store.get_summary();
-            print_summary(&summary);
-        }
-
-        Commands::Sessions { count } => {
-            print_sessions(&metrics_store, count);
-        }
-
-        Commands::Export { format, output } => {
-            let output_path = match output {
-                Some(path) => path,
-                None => PathBuf::from("metrics-report.txt"),
-            };
-            export_metrics(&metrics_store, &format, &output_path)?;
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn print_summary(summary: &crate::metrics::MetricsSummary) {
     println!("\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
     println!("  QUALITY GATE SUMMARY");
     println!("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
     println!();
     println!("  Sessions:");

*** result: Success
