*** src/dashboard/mod.rs:71:31: replace > with >= in print_summary

*** mutation diff:
--- src/dashboard/mod.rs
+++ replace > with >= in print_summary
@@ -63,17 +63,17 @@
     println!("\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
     println!("  QUALITY GATE SUMMARY");
     println!("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
     println!();
     println!("  Sessions:");
     println!("    Total: {}", summary.total_sessions);
 
     let total = summary.total_sessions;
-    let passed_pct = if total > 0 {
+    let passed_pct = if total >= /* ~ changed by cargo-mutants ~ */ 0 {
         #[allow(clippy::cast_precision_loss)]
         {
             summary.passed_sessions as f64 / total as f64 * 100.0
         }
     } else {
         0.0
     };
     let failed_pct = if total > 0 {

*** result: Success
