*** src/dashboard/mod.rs:79:31: replace > with >= in print_summary

*** mutation diff:
--- src/dashboard/mod.rs
+++ replace > with >= in print_summary
@@ -71,17 +71,17 @@
     let passed_pct = if total > 0 {
         #[allow(clippy::cast_precision_loss)]
         {
             summary.passed_sessions as f64 / total as f64 * 100.0
         }
     } else {
         0.0
     };
-    let failed_pct = if total > 0 {
+    let failed_pct = if total >= /* ~ changed by cargo-mutants ~ */ 0 {
         #[allow(clippy::cast_precision_loss)]
         {
             summary.failed_sessions as f64 / total as f64 * 100.0
         }
     } else {
         0.0
     };
     let escalated_pct = if total > 0 {

*** result: Success
