*** src/dashboard/mod.rs:87:34: replace > with < in print_summary

*** mutation diff:
--- src/dashboard/mod.rs
+++ replace > with < in print_summary
@@ -79,17 +79,17 @@
     let failed_pct = if total > 0 {
         #[allow(clippy::cast_precision_loss)]
         {
             summary.failed_sessions as f64 / total as f64 * 100.0
         }
     } else {
         0.0
     };
-    let escalated_pct = if total > 0 {
+    let escalated_pct = if total < /* ~ changed by cargo-mutants ~ */ 0 {
         #[allow(clippy::cast_precision_loss)]
         {
             summary.escalated_sessions as f64 / total as f64 * 100.0
         }
     } else {
         0.0
     };

*** result: Success
