*** src/dashboard/mod.rs:90:62: replace * with + in print_summary

*** mutation diff:
--- src/dashboard/mod.rs
+++ replace * with + in print_summary
@@ -82,17 +82,17 @@
             summary.failed_sessions as f64 / total as f64 * 100.0
         }
     } else {
         0.0
     };
     let escalated_pct = if total > 0 {
         #[allow(clippy::cast_precision_loss)]
         {
-            summary.escalated_sessions as f64 / total as f64 * 100.0
+            summary.escalated_sessions as f64 / total as f64 + /* ~ changed by cargo-mutants ~ */ 100.0
         }
     } else {
         0.0
     };
 
     println!("    Passed: {} ({passed_pct:.1}%)", summary.passed_sessions);
     println!("    Failed: {} ({failed_pct:.1}%)", summary.failed_sessions);
     println!(

*** result: Success
