*** src/expression_depth/mod.rs:105:19: replace >= with < in ExpressionDepth::increment

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace >= with < in ExpressionDepth::increment
@@ -97,17 +97,17 @@
     /// ```
     /// use oya_frontend::expression_depth::ExpressionDepth;
     ///
     /// let depth = ExpressionDepth::new(100).unwrap();
     /// let next = depth.increment().unwrap();
     /// assert_eq!(next.current(), 101);
     /// ```
     pub const fn increment(&self) -> Result<Self, Error> {
-        if self.0 >= MAX_EXPRESSION_DEPTH {
+        if self.0 < /* ~ changed by cargo-mutants ~ */ MAX_EXPRESSION_DEPTH {
             Err(Error::DepthLimitExceeded {
                 current_depth: self.0,
                 max_depth: MAX_EXPRESSION_DEPTH,
             })
         } else {
             Ok(Self(self.0 + 1))
         }
     }

*** result: Success
