*** src/expression_depth/mod.rs:133:9: replace ExpressionDepth::is_valid -> bool with true

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace ExpressionDepth::is_valid -> bool with true
@@ -125,17 +125,17 @@
     /// ```
     /// use oya_frontend::expression_depth::ExpressionDepth;
     ///
     /// let valid = ExpressionDepth::new(1024).unwrap();
     /// assert!(valid.is_valid());
     /// ```
     #[must_use]
     pub const fn is_valid(&self) -> bool {
-        self.0 <= MAX_EXPRESSION_DEPTH
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::fmt::Display for ExpressionDepth {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         write!(f, "{}", self.0)
     }
 }

*** result: Success
