*** src/expression_depth/mod.rs:139:9: replace <impl std::fmt::Display for ExpressionDepth>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace <impl std::fmt::Display for ExpressionDepth>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -131,17 +131,17 @@
     #[must_use]
     pub const fn is_valid(&self) -> bool {
         self.0 <= MAX_EXPRESSION_DEPTH
     }
 }
 
 impl std::fmt::Display for ExpressionDepth {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        write!(f, "{}", self.0)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Checks if a value looks like a reference (contains special characters).
 fn looks_like_reference(value: &str) -> bool {
     // References typically contain special characters like {, }, [, ], etc.
     value.contains('{') || value.contains('}') || value.contains('[') || value.contains(']')
 }

*** result: Success
