*** src/expression_depth/mod.rs:146:25: replace || with && in looks_like_reference

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace || with && in looks_like_reference
@@ -138,17 +138,17 @@
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         write!(f, "{}", self.0)
     }
 }
 
 /// Checks if a value looks like a reference (contains special characters).
 fn looks_like_reference(value: &str) -> bool {
     // References typically contain special characters like {, }, [, ], etc.
-    value.contains('{') || value.contains('}') || value.contains('[') || value.contains(']')
+    value.contains('{') && /* ~ changed by cargo-mutants ~ */ value.contains('}') || value.contains('[') || value.contains(']')
 }
 
 /// Error taxonomy for expression resolution
 ///
 /// This enum provides comprehensive error coverage for all failure modes in
 /// expression depth tracking and resolution.
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum Error {

*** result: Success
