*** src/expression_depth/mod.rs:189:9: replace <impl std::fmt::Display for Error>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace <impl std::fmt::Display for Error>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -181,33 +181,17 @@
     RuntimeError {
         /// Human-readable error message
         message: String,
     },
 }
 
 impl std::fmt::Display for Error {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::DepthLimitExceeded {
-                current_depth,
-                max_depth,
-            } => write!(
-                f,
-                "Expression depth {current_depth} exceeds maximum of {max_depth}"
-            ),
-            Self::InvalidExpression => write!(f, "Invalid expression syntax or structure"),
-            Self::ExpressionNotFound { reference } => {
-                write!(f, "Expression '{reference}' not found")
-            }
-            Self::TypeError { expected, actual } => {
-                write!(f, "Expected {expected}, found {actual}")
-            }
-            Self::RuntimeError { message } => write!(f, "Runtime error: {message}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for Error {}
 
 /// Reference to another expression in the registry
 pub type ExpressionRef = Arc<Expression>;

*** result: Success
