*** src/expression_depth/mod.rs:246:9: replace <impl FromExpression for i32>::from_expression_string -> Result<Self, Error> with Ok(Default::default())

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace <impl FromExpression for i32>::from_expression_string -> Result<Self, Error> with Ok(Default::default())
@@ -238,20 +238,17 @@
     ///
     /// # Errors
     /// Returns `Error::TypeError` if the value cannot be parsed as the target type.
     fn from_expression_string(value: &str) -> Result<Self, Error>;
 }
 
 impl FromExpression for i32 {
     fn from_expression_string(value: &str) -> Result<Self, Error> {
-        value.parse::<Self>().map_err(|_| Error::TypeError {
-            expected: "i32",
-            actual: "String",
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromExpression for bool {
     fn from_expression_string(value: &str) -> Result<Self, Error> {
         match value.to_lowercase().as_str() {
             "true" => Ok(true),
             "false" => Ok(false),

*** result: Success
