*** src/expression_depth/mod.rs:255:9: replace <impl FromExpression for bool>::from_expression_string -> Result<Self, Error> with Ok(Default::default())

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace <impl FromExpression for bool>::from_expression_string -> Result<Self, Error> with Ok(Default::default())
@@ -247,24 +247,17 @@
             expected: "i32",
             actual: "String",
         })
     }
 }
 
 impl FromExpression for bool {
     fn from_expression_string(value: &str) -> Result<Self, Error> {
-        match value.to_lowercase().as_str() {
-            "true" => Ok(true),
-            "false" => Ok(false),
-            _ => Err(Error::TypeError {
-                expected: "bool",
-                actual: "String",
-            }),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromExpression for String {
     fn from_expression_string(value: &str) -> Result<Self, Error> {
         Ok(value.to_string())
     }
 }

*** result: Success
