*** src/expression_depth/mod.rs:256:13: delete match arm "true" in <impl FromExpression for bool>::from_expression_string

*** mutation diff:
--- src/expression_depth/mod.rs
+++ delete match arm "true" in <impl FromExpression for bool>::from_expression_string
@@ -248,17 +248,17 @@
             actual: "String",
         })
     }
 }
 
 impl FromExpression for bool {
     fn from_expression_string(value: &str) -> Result<Self, Error> {
         match value.to_lowercase().as_str() {
-            "true" => Ok(true),
+             /* ~ changed by cargo-mutants ~ */
             "false" => Ok(false),
             _ => Err(Error::TypeError {
                 expected: "bool",
                 actual: "String",
             }),
         }
     }
 }

*** result: Success
