*** src/expression_depth/mod.rs:257:13: delete match arm "false" in <impl FromExpression for bool>::from_expression_string

*** mutation diff:
--- src/expression_depth/mod.rs
+++ delete match arm "false" in <impl FromExpression for bool>::from_expression_string
@@ -249,17 +249,17 @@
         })
     }
 }
 
 impl FromExpression for bool {
     fn from_expression_string(value: &str) -> Result<Self, Error> {
         match value.to_lowercase().as_str() {
             "true" => Ok(true),
-            "false" => Ok(false),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(Error::TypeError {
                 expected: "bool",
                 actual: "String",
             }),
         }
     }
 }

*** result: Success
