*** src/expression_depth/mod.rs:292:5: replace calculate_depth -> u32 with 1

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace calculate_depth -> u32 with 1
@@ -284,26 +284,17 @@
 /// let leaf = Expression {
 ///     value: Some("leaf".to_string()),
 ///     children: vec![],
 /// };
 /// assert_eq!(calculate_depth(&leaf), 0);
 /// ```
 #[must_use]
 pub fn calculate_depth(expression: &Expression) -> u32 {
-    if expression.children.is_empty() {
-        0
-    } else {
-        1 + expression
-            .children
-            .iter()
-            .map(|child| calculate_depth(child))
-            .max()
-            .unwrap_or(0)
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Validate expression depth before resolution.
 ///
 /// # Arguments
 /// * `expression` - The expression to validate
 ///
 /// # Returns

*** result: Success
