*** src/expression_depth/mod.rs:390:8: delete ! in resolve_expressions

*** mutation diff:
--- src/expression_depth/mod.rs
+++ delete ! in resolve_expressions
@@ -382,17 +382,17 @@
     expression: &Expression,
     registry: &ExpressionRegistry,
     current_depth: ExpressionDepth,
 ) -> Result<ResolvedExpression<T>, Error>
 where
     T: FromExpression,
 {
     // Contract enforcement: check depth before processing
-    if !current_depth.is_valid() {
+    if  /* ~ changed by cargo-mutants ~ */current_depth.is_valid() {
         return Err(Error::DepthLimitExceeded {
             current_depth: current_depth.current(),
             max_depth: MAX_EXPRESSION_DEPTH,
         });
     }
 
     // Check for expression reference (value field contains reference name)
     if let Some(ref value) = expression.value {

*** result: Success
