*** src/expression_depth/mod.rs:415:47: replace || with && in resolve_expressions

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace || with && in resolve_expressions
@@ -407,17 +407,17 @@
         match T::from_expression_string(value) {
             Ok(parsed_value) => {
                 return Ok(ResolvedExpression {
                     value: parsed_value,
                 })
             }
             Err(Error::TypeError { .. }) => {
                 // Check if this looks like a runtime error (division by zero, etc.)
-                if value.contains("div_zero") || value.contains('/') {
+                if value.contains("div_zero") && /* ~ changed by cargo-mutants ~ */ value.contains('/') {
                     return Err(Error::RuntimeError {
                         message: "Runtime error during expression evaluation".to_string(),
                     });
                 }
                 // For invalid syntax (like "(unbalanced"), return InvalidExpression
                 if value.starts_with('(') || value.contains("unbalanced") {
                     return Err(Error::InvalidExpression);
                 }

*** result: Success
