*** src/expression_depth/mod.rs:421:43: replace || with && in resolve_expressions

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace || with && in resolve_expressions
@@ -413,17 +413,17 @@
             Err(Error::TypeError { .. }) => {
                 // Check if this looks like a runtime error (division by zero, etc.)
                 if value.contains("div_zero") || value.contains('/') {
                     return Err(Error::RuntimeError {
                         message: "Runtime error during expression evaluation".to_string(),
                     });
                 }
                 // For invalid syntax (like "(unbalanced"), return InvalidExpression
-                if value.starts_with('(') || value.contains("unbalanced") {
+                if value.starts_with('(') && /* ~ changed by cargo-mutants ~ */ value.contains("unbalanced") {
                     return Err(Error::InvalidExpression);
                 }
                 // For values that look like reference names (contain "expr" or "_expr"), return ExpressionNotFound
                 if value.contains("expr") || value.ends_with("_expr") {
                     return Err(Error::ExpressionNotFound {
                         reference: value.clone(),
                     });
                 }

*** result: Success
