*** src/expression_depth/mod.rs:84:9: replace ExpressionDepth::current -> u32 with 0

*** mutation diff:
--- src/expression_depth/mod.rs
+++ replace ExpressionDepth::current -> u32 with 0
@@ -76,17 +76,17 @@
     /// ```
     /// use oya_frontend::expression_depth::ExpressionDepth;
     ///
     /// let depth = ExpressionDepth::new(5).unwrap();
     /// assert_eq!(depth.current(), 5);
     /// ```
     #[must_use]
     pub const fn current(&self) -> u32 {
-        self.0
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Increments the depth by one, with validation.
     ///
     /// # Returns
     /// * `Ok(ExpressionDepth)` with incremented depth if result is within bounds
     /// * `Err(Error::DepthLimitExceeded)` if increment would exceed maximum
     ///

*** result: Success
