*** src/graph/execution_state/mod.rs:208:9: delete match arm (ExecutionState::Queued, ExecutionState::Skipped) in try_transition

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ delete match arm (ExecutionState::Queued, ExecutionState::Skipped) in try_transition
@@ -200,17 +200,17 @@
 }
 
 #[must_use]
 pub const fn try_transition(from: ExecutionState, to: ExecutionState) -> Option<StateTransition> {
     match (from, to) {
         (ExecutionState::Idle, ExecutionState::Queued) => Some(StateTransition::IdleToQueued),
         (ExecutionState::Idle, ExecutionState::Skipped) => Some(StateTransition::IdleToSkipped),
         (ExecutionState::Queued, ExecutionState::Running) => Some(StateTransition::QueuedToRunning),
-        (ExecutionState::Queued, ExecutionState::Skipped) => Some(StateTransition::QueuedToSkipped),
+         /* ~ changed by cargo-mutants ~ */
         (ExecutionState::Running, ExecutionState::Completed) => {
             Some(StateTransition::RunningToCompleted)
         }
         (ExecutionState::Running, ExecutionState::Failed) => Some(StateTransition::RunningToFailed),
         _ => None,
     }
 }

---- graph::execution_state::tests::api_verification_tests::valid_transitions_return_correct_variant stdout ----

thread 'graph::execution_state::tests::api_verification_tests::valid_transitions_return_correct_variant' (2473306) panicked at src/graph/execution_state/tests/api_verification_tests.rs:134:5:
assertion `left == right` failed
  left: None
 right: Some(QueuedToSkipped)

---- graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_queued_to_skipped stdout ----

thread 'graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_queued_to_skipped' (2473335) panicked at src/graph/execution_state/tests/can_transition_tests.rs:30:5:
assertion failed: can_transition(ExecutionState::Queued, ExecutionState::Skipped)

---- graph::execution_state::tests::try_transition_tests::try_transition_returns_some_for_queued_to_skipped stdout ----

thread 'graph::execution_state::tests::try_transition_tests::try_transition_returns_some_for_queued_to_skipped' (2473468) panicked at src/graph/execution_state/tests/try_transition_tests.rs:28:5:
assertion `left == right` failed
  left: None
 right: Some(QueuedToSkipped)

failures:
    graph::execution_state::tests::api_verification_tests::valid_transitions_return_correct_variant
    graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_queued_to_skipped
    graph::execution_state::tests::try_transition_tests::try_transition_returns_some_for_queued_to_skipped

test result: FAILED. 896 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
