*** src/graph/execution_state/mod.rs:209:9: delete match arm (ExecutionState::Running, ExecutionState::Completed) in try_transition

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ delete match arm (ExecutionState::Running, ExecutionState::Completed) in try_transition
@@ -201,19 +201,17 @@
 
 #[must_use]
 pub const fn try_transition(from: ExecutionState, to: ExecutionState) -> Option<StateTransition> {
     match (from, to) {
         (ExecutionState::Idle, ExecutionState::Queued) => Some(StateTransition::IdleToQueued),
         (ExecutionState::Idle, ExecutionState::Skipped) => Some(StateTransition::IdleToSkipped),
         (ExecutionState::Queued, ExecutionState::Running) => Some(StateTransition::QueuedToRunning),
         (ExecutionState::Queued, ExecutionState::Skipped) => Some(StateTransition::QueuedToSkipped),
-        (ExecutionState::Running, ExecutionState::Completed) => {
-            Some(StateTransition::RunningToCompleted)
-        }
+         /* ~ changed by cargo-mutants ~ */
         (ExecutionState::Running, ExecutionState::Failed) => Some(StateTransition::RunningToFailed),
         _ => None,
     }
 }
 
 #[must_use]
 pub const fn can_transition(from: ExecutionState, to: ExecutionState) -> bool {
     try_transition(from, to).is_some()

---- graph::execution_state::tests::api_verification_tests::can_transition_consistent_with_try_transition stdout ----

thread 'graph::execution_state::tests::api_verification_tests::can_transition_consistent_with_try_transition' (2492313) panicked at src/graph/execution_state/tests/api_verification_tests.rs:187:5:
assertion failed: can_transition(ExecutionState::Running, ExecutionState::Completed)

---- graph::execution_state::tests::api_verification_tests::valid_transitions_return_correct_variant stdout ----

thread 'graph::execution_state::tests::api_verification_tests::valid_transitions_return_correct_variant' (2492322) panicked at src/graph/execution_state/tests/api_verification_tests.rs:138:5:
assertion `left == right` failed
  left: None
 right: Some(RunningToCompleted)

---- graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_running_to_completed stdout ----

thread 'graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_running_to_completed' (2492362) panicked at src/graph/execution_state/tests/can_transition_tests.rs:38:5:
assertion failed: can_transition(ExecutionState::Running, ExecutionState::Completed)

failures:
    graph::execution_state::tests::api_verification_tests::can_transition_consistent_with_try_transition
    graph::execution_state::tests::api_verification_tests::valid_transitions_return_correct_variant
    graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_running_to_completed
    graph::execution_state::tests::try_transition_tests::try_transition_returns_some_for_running_to_completed

test result: FAILED. 895 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
