*** src/graph/execution_state/mod.rs:219:5: replace can_transition -> bool with false

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace can_transition -> bool with false
@@ -211,17 +211,17 @@
         }
         (ExecutionState::Running, ExecutionState::Failed) => Some(StateTransition::RunningToFailed),
         _ => None,
     }
 }
 
 #[must_use]
 pub const fn can_transition(from: ExecutionState, to: ExecutionState) -> bool {
-    try_transition(from, to).is_some()
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 // ===========================================================================
 // State Machine Conversions
 // ===========================================================================
 
 impl From<IdleState> for ExecutionState {
     fn from(_: IdleState) -> Self {

---- graph::core::tests::node_when_setting_status_then_status_is_updated_in_execution_state_and_config stdout ----

thread 'graph::core::tests::node_when_setting_status_then_status_is_updated_in_execution_state_and_config' (2545933) panicked at src/graph/core.rs:234:9:
assertion `left == right` failed
  left: Idle
 right: Running

---- graph::core::tests::given_idle_node_when_setting_pending_status_then_status_is_queued stdout ----

thread 'graph::core::tests::given_idle_node_when_setting_pending_status_then_status_is_queued' (2545919) panicked at src/graph/core.rs:519:9:
assertion failed: result.is_ok()

---- graph::execution_state::tests::api_verification_tests::can_transition_consistent_with_try_transition stdout ----

thread 'graph::execution_state::tests::api_verification_tests::can_transition_consistent_with_try_transition' (2546096) panicked at src/graph/execution_state/tests/api_verification_tests.rs:186:5:
assertion failed: can_transition(ExecutionState::Idle, ExecutionState::Queued)

failures:
    graph::core::tests::given_idle_node_when_setting_pending_status_then_status_is_queued
    graph::core::tests::node_when_setting_status_then_status_is_updated_in_execution_state_and_config
    graph::execution_state::tests::api_verification_tests::can_transition_consistent_with_try_transition
    graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_idle_to_queued
    graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_idle_to_skipped
    graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_queued_to_running
    graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_queued_to_skipped
    graph::execution_state::tests::can_transition_tests::can_transition_returns_true_for_running_to_completed
    graph::execution_state::tests::can_transition_tests::can

test result: FAILED. 888 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
