*** src/graph/execution_state/mod.rs:252:9: replace <impl From<FailedState> for ExecutionState>::from -> Self with Default::default()

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace <impl From<FailedState> for ExecutionState>::from -> Self with Default::default()
@@ -244,17 +244,17 @@
 impl From<CompletedState> for ExecutionState {
     fn from(_: CompletedState) -> Self {
         Self::Completed
     }
 }
 
 impl From<FailedState> for ExecutionState {
     fn from(_: FailedState) -> Self {
-        Self::Failed
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<SkippedState> for ExecutionState {
     fn from(_: SkippedState) -> Self {
         Self::Skipped
     }
 }

---- graph::execution_state::tests::type_state_tests::failed_state_converts_to_execution_state_failed stdout ----

thread 'graph::execution_state::tests::type_state_tests::failed_state_converts_to_execution_state_failed' (2588695) panicked at src/graph/execution_state/tests/type_state_tests.rs:88:5:
assertion `left == right` failed
  left: Idle
 right: Failed

failures:
    graph::execution_state::tests::type_state_tests::failed_state_converts_to_execution_state_failed

test result: FAILED. 898 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
