*** src/graph/execution_state/mod.rs:258:9: replace <impl From<SkippedState> for ExecutionState>::from -> Self with Default::default()

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace <impl From<SkippedState> for ExecutionState>::from -> Self with Default::default()
@@ -250,17 +250,17 @@
 impl From<FailedState> for ExecutionState {
     fn from(_: FailedState) -> Self {
         Self::Failed
     }
 }
 
 impl From<SkippedState> for ExecutionState {
     fn from(_: SkippedState) -> Self {
-        Self::Skipped
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ===========================================================================
 // TESTS
 // ===========================================================================
 
 #[cfg(test)]

---- graph::execution_state::tests::type_state_tests::skipped_state_converts_to_execution_state_skipped stdout ----

thread 'graph::execution_state::tests::type_state_tests::skipped_state_converts_to_execution_state_skipped' (2591346) panicked at src/graph/execution_state/tests/type_state_tests.rs:94:5:
assertion `left == right` failed
  left: Idle
 right: Skipped

failures:
    graph::execution_state::tests::type_state_tests::skipped_state_converts_to_execution_state_skipped

test result: FAILED. 898 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
