*** src/graph/execution_state/mod.rs:29:9: replace <impl fmt::Display for ExecutionState>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace <impl fmt::Display for ExecutionState>::fmt -> fmt::Result with Ok(Default::default())
@@ -21,24 +21,17 @@
     Running,
     Completed,
     Failed,
     Skipped,
 }
 
 impl fmt::Display for ExecutionState {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Idle => write!(f, "idle"),
-            Self::Queued => write!(f, "queued"),
-            Self::Running => write!(f, "running"),
-            Self::Completed => write!(f, "completed"),
-            Self::Failed => write!(f, "failed"),
-            Self::Skipped => write!(f, "skipped"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ExecutionState {
     #[must_use]
     pub const fn is_terminal(self) -> bool {
         matches!(self, Self::Completed | Self::Failed | Self::Skipped)
     }

---- graph::core::tests::node_when_setting_status_then_status_is_updated_in_execution_state_and_config stdout ----

thread 'graph::core::tests::node_when_setting_status_then_status_is_updated_in_execution_state_and_config' (2327575) panicked at src/graph/core.rs:236:9:
assertion `left == right` failed
  left: Some("")
 right: Some("running")

---- graph::execution_state::tests::state_tests::execution_state_display_shows_completed_lowercase stdout ----

thread 'graph::execution_state::tests::state_tests::execution_state_display_shows_completed_lowercase' (2327696) panicked at src/graph/execution_state/tests/state_tests.rs:24:5:
assertion `left == right` failed
  left: ""
 right: "completed"

---- graph::execution_state::tests::state_tests::execution_state_display_shows_failed_lowercase stdout ----

thread 'graph::execution_state::tests::state_tests::execution_state_display_shows_failed_lowercase' (2327697) panicked at src/graph/execution_state/tests/state_tests.rs:29:5:
assertion `left == right` failed
  left: ""
 right: "failed"

failures:
    graph::core::tests::node_when_setting_status_then_status_is_updated_in_execution_state_and_config
    graph::execution_state::tests::state_tests::execution_state_display_shows_completed_lowercase
    graph::execution_state::tests::state_tests::execution_state_display_shows_failed_lowercase
    graph::execution_state::tests::state_tests::execution_state_display_shows_idle_lowercase
    graph::execution_state::tests::state_tests::execution_state_display_shows_queued_lowercase
    graph::execution_state::tests::state_tests::execution_state_display_shows_running_lowercase
    graph::execution_state::tests::state_tests::execution_state_display_shows_skipped_lowercase
    graph::execution_state::tests::transition_tests::invalid_transition_display_shows_from_and_to
    graph::execution_state::tests::transition_tests::invalid_transition_display_shows_queued_to_failed
    graph::exe

test result: FAILED. 889 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
