*** src/graph/execution_state/mod.rs:43:9: replace ExecutionState::is_terminal -> bool with true

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace ExecutionState::is_terminal -> bool with true
@@ -35,17 +35,17 @@
             Self::Skipped => write!(f, "skipped"),
         }
     }
 }
 
 impl ExecutionState {
     #[must_use]
     pub const fn is_terminal(self) -> bool {
-        matches!(self, Self::Completed | Self::Failed | Self::Skipped)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn is_active(self) -> bool {
         matches!(self, Self::Running | Self::Queued)
     }
 
     #[must_use]

---- graph::execution_state::tests::state_tests::is_terminal_returns_false_for_queued stdout ----

thread 'graph::execution_state::tests::state_tests::is_terminal_returns_false_for_queued' (2389172) panicked at src/graph/execution_state/tests/state_tests.rs:63:5:
assertion failed: !ExecutionState::Queued.is_terminal()

---- graph::execution_state::tests::state_tests::is_terminal_returns_false_for_running stdout ----

thread 'graph::execution_state::tests::state_tests::is_terminal_returns_false_for_running' (2389173) panicked at src/graph/execution_state/tests/state_tests.rs:68:5:
assertion failed: !ExecutionState::Running.is_terminal()

---- graph::execution_state::tests::state_tests::is_terminal_returns_false_for_idle stdout ----

thread 'graph::execution_state::tests::state_tests::is_terminal_returns_false_for_idle' (2389171) panicked at src/graph/execution_state/tests/state_tests.rs:58:5:
assertion failed: !ExecutionState::Idle.is_terminal()

failures:
    graph::execution_state::tests::state_tests::is_terminal_returns_false_for_idle
    graph::execution_state::tests::state_tests::is_terminal_returns_false_for_queued
    graph::execution_state::tests::state_tests::is_terminal_returns_false_for_running
    graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct

test result: FAILED. 895 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
