*** src/graph/execution_state/mod.rs:43:9: replace ExecutionState::is_terminal -> bool with false

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace ExecutionState::is_terminal -> bool with false
@@ -35,17 +35,17 @@
             Self::Skipped => write!(f, "skipped"),
         }
     }
 }
 
 impl ExecutionState {
     #[must_use]
     pub const fn is_terminal(self) -> bool {
-        matches!(self, Self::Completed | Self::Failed | Self::Skipped)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn is_active(self) -> bool {
         matches!(self, Self::Running | Self::Queued)
     }
 
     #[must_use]

---- graph::execution_state::tests::state_tests::is_terminal_returns_true_for_failed stdout ----

thread 'graph::execution_state::tests::state_tests::is_terminal_returns_true_for_failed' (2383537) panicked at src/graph/execution_state/tests/state_tests.rs:48:5:
assertion failed: ExecutionState::Failed.is_terminal()

---- graph::execution_state::tests::state_tests::is_terminal_returns_true_for_skipped stdout ----

thread 'graph::execution_state::tests::state_tests::is_terminal_returns_true_for_skipped' (2383538) panicked at src/graph/execution_state/tests/state_tests.rs:53:5:
assertion failed: ExecutionState::Skipped.is_terminal()

---- graph::execution_state::tests::state_tests::is_terminal_returns_true_for_completed stdout ----

thread 'graph::execution_state::tests::state_tests::is_terminal_returns_true_for_completed' (2383536) panicked at src/graph/execution_state/tests/state_tests.rs:43:5:
assertion failed: ExecutionState::Completed.is_terminal()

failures:
    graph::execution_state::tests::state_tests::is_terminal_returns_true_for_completed
    graph::execution_state::tests::state_tests::is_terminal_returns_true_for_failed
    graph::execution_state::tests::state_tests::is_terminal_returns_true_for_skipped
    graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct

test result: FAILED. 895 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
