*** src/graph/execution_state/mod.rs:48:9: replace ExecutionState::is_active -> bool with true

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace ExecutionState::is_active -> bool with true
@@ -40,17 +40,17 @@
 impl ExecutionState {
     #[must_use]
     pub const fn is_terminal(self) -> bool {
         matches!(self, Self::Completed | Self::Failed | Self::Skipped)
     }
 
     #[must_use]
     pub const fn is_active(self) -> bool {
-        matches!(self, Self::Running | Self::Queued)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn is_idle(self) -> bool {
         matches!(self, Self::Idle)
     }
 }

---- graph::execution_state::tests::state_tests::is_active_returns_false_for_idle stdout ----

thread 'graph::execution_state::tests::state_tests::is_active_returns_false_for_idle' (2393190) panicked at src/graph/execution_state/tests/state_tests.rs:87:5:
assertion failed: !ExecutionState::Idle.is_active()

---- graph::execution_state::tests::state_tests::is_active_returns_false_for_completed stdout ----

thread 'graph::execution_state::tests::state_tests::is_active_returns_false_for_completed' (2393188) panicked at src/graph/execution_state/tests/state_tests.rs:92:5:
assertion failed: !ExecutionState::Completed.is_active()

---- graph::execution_state::tests::state_tests::is_active_returns_false_for_failed stdout ----

thread 'graph::execution_state::tests::state_tests::is_active_returns_false_for_failed' (2393189) panicked at src/graph/execution_state/tests/state_tests.rs:97:5:
assertion failed: !ExecutionState::Failed.is_active()

failures:
    graph::execution_state::tests::state_tests::is_active_returns_false_for_completed
    graph::execution_state::tests::state_tests::is_active_returns_false_for_failed
    graph::execution_state::tests::state_tests::is_active_returns_false_for_idle
    graph::execution_state::tests::state_tests::is_active_returns_false_for_skipped
    graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct

test result: FAILED. 894 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
