*** src/graph/execution_state/mod.rs:48:9: replace ExecutionState::is_active -> bool with false

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace ExecutionState::is_active -> bool with false
@@ -40,17 +40,17 @@
 impl ExecutionState {
     #[must_use]
     pub const fn is_terminal(self) -> bool {
         matches!(self, Self::Completed | Self::Failed | Self::Skipped)
     }
 
     #[must_use]
     pub const fn is_active(self) -> bool {
-        matches!(self, Self::Running | Self::Queued)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn is_idle(self) -> bool {
         matches!(self, Self::Idle)
     }
 }

---- graph::execution_state::tests::state_tests::is_active_returns_true_for_running stdout ----

thread 'graph::execution_state::tests::state_tests::is_active_returns_true_for_running' (2337510) panicked at src/graph/execution_state/tests/state_tests.rs:77:5:
assertion failed: ExecutionState::Running.is_active()

---- graph::execution_state::tests::state_tests::is_active_returns_true_for_queued stdout ----

thread 'graph::execution_state::tests::state_tests::is_active_returns_true_for_queued' (2337509) panicked at src/graph/execution_state/tests/state_tests.rs:82:5:
assertion failed: ExecutionState::Queued.is_active()

---- graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct stdout ----

thread 'graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct' (2337547) panicked at src/graph/execution_state/tests/symbol_verification_tests.rs:39:5:
assertion failed: ExecutionState::Running.is_active()

failures:
    graph::execution_state::tests::state_tests::is_active_returns_true_for_queued
    graph::execution_state::tests::state_tests::is_active_returns_true_for_running
    graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct

test result: FAILED. 896 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
