*** src/graph/execution_state/mod.rs:53:9: replace ExecutionState::is_idle -> bool with true

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace ExecutionState::is_idle -> bool with true
@@ -45,17 +45,17 @@
 
     #[must_use]
     pub const fn is_active(self) -> bool {
         matches!(self, Self::Running | Self::Queued)
     }
 
     #[must_use]
     pub const fn is_idle(self) -> bool {
-        matches!(self, Self::Idle)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ===========================================================================
 // Invalid Transition Error
 // ===========================================================================
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]

---- graph::execution_state::tests::state_tests::is_idle_returns_false_for_completed stdout ----

thread 'graph::execution_state::tests::state_tests::is_idle_returns_false_for_completed' (2357493) panicked at src/graph/execution_state/tests/state_tests.rs:126:5:
assertion failed: !ExecutionState::Completed.is_idle()

---- graph::execution_state::tests::state_tests::is_idle_returns_false_for_running stdout ----

thread 'graph::execution_state::tests::state_tests::is_idle_returns_false_for_running' (2357498) panicked at src/graph/execution_state/tests/state_tests.rs:121:5:
assertion failed: !ExecutionState::Running.is_idle()

---- graph::execution_state::tests::state_tests::is_idle_returns_false_for_skipped stdout ----

thread 'graph::execution_state::tests::state_tests::is_idle_returns_false_for_skipped' (2357499) panicked at src/graph/execution_state/tests/state_tests.rs:136:5:
assertion failed: !ExecutionState::Skipped.is_idle()

failures:
    graph::execution_state::tests::state_tests::is_idle_returns_false_for_completed
    graph::execution_state::tests::state_tests::is_idle_returns_false_for_failed
    graph::execution_state::tests::state_tests::is_idle_returns_false_for_queued
    graph::execution_state::tests::state_tests::is_idle_returns_false_for_running
    graph::execution_state::tests::state_tests::is_idle_returns_false_for_skipped
    graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct

test result: FAILED. 893 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
