*** src/graph/execution_state/mod.rs:53:9: replace ExecutionState::is_idle -> bool with false

*** mutation diff:
--- src/graph/execution_state/mod.rs
+++ replace ExecutionState::is_idle -> bool with false
@@ -45,17 +45,17 @@
 
     #[must_use]
     pub const fn is_active(self) -> bool {
         matches!(self, Self::Running | Self::Queued)
     }
 
     #[must_use]
     pub const fn is_idle(self) -> bool {
-        matches!(self, Self::Idle)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ===========================================================================
 // Invalid Transition Error
 // ===========================================================================
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]

---- graph::execution_state::tests::state_tests::is_idle_returns_true_for_idle stdout ----

thread 'graph::execution_state::tests::state_tests::is_idle_returns_true_for_idle' (2390613) panicked at src/graph/execution_state/tests/state_tests.rs:111:5:
assertion failed: ExecutionState::Idle.is_idle()

---- graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct stdout ----

thread 'graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct' (2390663) panicked at src/graph/execution_state/tests/symbol_verification_tests.rs:41:5:
assertion failed: ExecutionState::Idle.is_idle()

failures:
    graph::execution_state::tests::state_tests::is_idle_returns_true_for_idle
    graph::execution_state::tests::symbol_verification_tests::execution_state_predicates_correct

test result: FAILED. 897 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
