*** src/main.rs:1304:16: replace match guard modifiers.ctrl with true in parse_key_event

*** mutation diff:
--- src/main.rs
+++ replace match guard modifiers.ctrl with true in parse_key_event
@@ -1296,17 +1296,17 @@
         "+" | "=" | "add" => Some(EditorCommand::ZoomIn),
         "-" | "_" | "subtract" => Some(EditorCommand::ZoomOut),
         "0" => Some(EditorCommand::FitView),
 
         // Undo/Redo - require Ctrl/Cmd modifier (security requirement)
         // Plain 'z'/'y' should NOT mutate history
         // Note: More specific patterns must come first
         "y" | "z" if modifiers.ctrl && modifiers.shift => Some(EditorCommand::Redo),
-        "z" if modifiers.ctrl => Some(EditorCommand::Undo),
+        "z" if true /* ~ changed by cargo-mutants ~ */ => Some(EditorCommand::Undo),
         "y" if modifiers.ctrl => Some(EditorCommand::Redo),
 
         // Auto layout - accessible via toolbar/context
         "l" if modifiers.ctrl => Some(EditorCommand::AutoLayout),
 
         _ => None,
     }
 }

*** result: Success
