*** src/main.rs:1308:16: replace match guard modifiers.ctrl with false in parse_key_event

*** mutation diff:
--- src/main.rs
+++ replace match guard modifiers.ctrl with false in parse_key_event
@@ -1300,17 +1300,17 @@
         // Undo/Redo - require Ctrl/Cmd modifier (security requirement)
         // Plain 'z'/'y' should NOT mutate history
         // Note: More specific patterns must come first
         "y" | "z" if modifiers.ctrl && modifiers.shift => Some(EditorCommand::Redo),
         "z" if modifiers.ctrl => Some(EditorCommand::Undo),
         "y" if modifiers.ctrl => Some(EditorCommand::Redo),
 
         // Auto layout - accessible via toolbar/context
-        "l" if modifiers.ctrl => Some(EditorCommand::AutoLayout),
+        "l" if false /* ~ changed by cargo-mutants ~ */ => Some(EditorCommand::AutoLayout),
 
         _ => None,
     }
 }
 
 /// Canvas dimensions for viewport calculations.
 #[derive(Clone, Copy, Debug)]
 pub struct CanvasDimensions {

*** result: Success
