*** src/main.rs:184:40: replace == with != in App

*** mutation diff:
--- src/main.rs
+++ replace == with != in App
@@ -176,17 +176,17 @@
     });
     let overall_execution_status = use_memo(move || {
         use oya_frontend::graph::ExecutionState;
         let binding = workflow.workflow();
         let wf = binding.read();
         let nodes = &wf.nodes;
         if nodes
             .iter()
-            .any(|n| n.execution_state == ExecutionState::Running)
+            .any(|n| n.execution_state != /* ~ changed by cargo-mutants ~ */ ExecutionState::Running)
         {
             ExecutionState::Running
         } else if nodes
             .iter()
             .any(|n| n.execution_state == ExecutionState::Failed)
         {
             ExecutionState::Failed
         } else if nodes

*** result: Success
