*** src/main.rs:189:40: replace == with != in App

*** mutation diff:
--- src/main.rs
+++ replace == with != in App
@@ -181,17 +181,17 @@
         let nodes = &wf.nodes;
         if nodes
             .iter()
             .any(|n| n.execution_state == ExecutionState::Running)
         {
             ExecutionState::Running
         } else if nodes
             .iter()
-            .any(|n| n.execution_state == ExecutionState::Failed)
+            .any(|n| n.execution_state != /* ~ changed by cargo-mutants ~ */ ExecutionState::Failed)
         {
             ExecutionState::Failed
         } else if nodes
             .iter()
             .all(|n| n.execution_state.is_terminal() || n.execution_state == ExecutionState::Idle)
             && nodes
                 .iter()
                 .any(|n| n.execution_state == ExecutionState::Completed)

*** result: Success
