*** src/main.rs:194:54: replace || with && in App

*** mutation diff:
--- src/main.rs
+++ replace || with && in App
@@ -186,17 +186,17 @@
             ExecutionState::Running
         } else if nodes
             .iter()
             .any(|n| n.execution_state == ExecutionState::Failed)
         {
             ExecutionState::Failed
         } else if nodes
             .iter()
-            .all(|n| n.execution_state.is_terminal() || n.execution_state == ExecutionState::Idle)
+            .all(|n| n.execution_state.is_terminal() && /* ~ changed by cargo-mutants ~ */ n.execution_state == ExecutionState::Idle)
             && nodes
                 .iter()
                 .any(|n| n.execution_state == ExecutionState::Completed)
         {
             ExecutionState::Completed
         } else {
             ExecutionState::Idle
         }

*** result: Success
