*** src/main.rs:286:36: replace + with - in App

*** mutation diff:
--- src/main.rs
+++ replace + with - in App
@@ -278,17 +278,17 @@
         if let crate::hooks::InteractionMode::Connecting { from, handle } = mode {
             let to = canvas.temp_edge().read().as_positions();
             if let Some((to_pos, _)) = to {
                 let node = nodes_by_id.read().get(&from).cloned();
                 node.map(|n| {
                     let from_pos = if handle.as_str() == "source" {
                         FlowPosition {
                             x: n.x + 220.0,
-                            y: n.y + 34.0,
+                            y: n.y - /* ~ changed by cargo-mutants ~ */ 34.0,
                         }
                     } else {
                         FlowPosition {
                             x: n.x,
                             y: n.y + 34.0,
                         }
                     };
                     (from_pos, to_pos)

*** result: Success
