*** src/main.rs:291:36: replace + with - in App

*** mutation diff:
--- src/main.rs
+++ replace + with - in App
@@ -283,17 +283,17 @@
                     let from_pos = if handle.as_str() == "source" {
                         FlowPosition {
                             x: n.x + 220.0,
                             y: n.y + 34.0,
                         }
                     } else {
                         FlowPosition {
                             x: n.x,
-                            y: n.y + 34.0,
+                            y: n.y - /* ~ changed by cargo-mutants ~ */ 34.0,
                         }
                     };
                     (from_pos, to_pos)
                 })
             } else {
                 None
             }
         } else {

*** result: Success
