*** src/main.rs:32:17: replace || with && in should_end_canvas_interaction

*** mutation diff:
--- src/main.rs
+++ replace || with && in should_end_canvas_interaction
@@ -24,17 +24,17 @@
 
 #[cfg(any(test, target_arch = "wasm32"))]
 const fn should_end_canvas_interaction(
     is_dragging: bool,
     is_panning: bool,
     is_marquee: bool,
     is_connecting: bool,
 ) -> bool {
-    is_dragging || is_panning || is_marquee || is_connecting
+    is_dragging && /* ~ changed by cargo-mutants ~ */ is_panning || is_marquee || is_connecting
 }
 
 #[cfg(target_arch = "wasm32")]
 struct GlobalMouseupListenerInner {
     window: web_sys::Window,
     callback: wasm_bindgen::closure::Closure<dyn FnMut(web_sys::MouseEvent)>,
 }

*** result: Success
