*** src/main.rs:44:9: replace <impl Drop for GlobalMouseupListenerInner>::drop with ()

*** mutation diff:
--- src/main.rs
+++ replace <impl Drop for GlobalMouseupListenerInner>::drop with ()
@@ -36,21 +36,17 @@
 struct GlobalMouseupListenerInner {
     window: web_sys::Window,
     callback: wasm_bindgen::closure::Closure<dyn FnMut(web_sys::MouseEvent)>,
 }
 
 #[cfg(target_arch = "wasm32")]
 impl Drop for GlobalMouseupListenerInner {
     fn drop(&mut self) {
-        use wasm_bindgen::JsCast;
-
-        let _ = self
-            .window
-            .remove_event_listener_with_callback("mouseup", self.callback.as_ref().unchecked_ref());
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(target_arch = "wasm32")]
 #[derive(Clone)]
 struct GlobalMouseupListener {
     _inner: std::rc::Rc<GlobalMouseupListenerInner>,
 }

*** result: Success
