*** src/bin/agent_feedback.rs:75:28: delete ! in main

*** mutation diff:
--- src/bin/agent_feedback.rs
+++ delete ! in main
@@ -67,17 +67,17 @@
         } => {
             let spec_content = std::fs::read_to_string(&validation_results_path)?;
             let validation: serde_json::Value = serde_json::from_str(&spec_content)?;
 
             let mut requests = Vec::new();
             if let Some(results) = validation["results"].as_array() {
                 for entry in results {
                     if let Some(passed) = entry["passed"].as_bool() {
-                        if !passed {
+                        if  /* ~ changed by cargo-mutants ~ */passed {
                             requests.push(FeedbackRequest {
                                 failure_category: FailureCategory::Validation,
                                 spec_ref: spec_id.clone(),
                                 iteration: 0,
                                 failure_context: format!(
                                     "Scenario failed: {}",
                                     entry["id"].as_str().map_or("unknown", |value| value)
                                 ),

*** result: Success
