*** src/bin/coverage.rs:25:5: replace main -> Result<(), Box<dyn std::error::Error>> with Ok(())

*** mutation diff:
--- src/bin/coverage.rs
+++ replace main -> Result<(), Box<dyn std::error::Error>> with Ok(())
@@ -17,37 +17,17 @@
     scenarios_dir: PathBuf,
 
     #[arg(short = 'f', long, default_value = "text")]
     format: String,
 }
 
 #[cfg(not(target_arch = "wasm32"))]
 fn main() -> Result<(), Box<dyn std::error::Error>> {
-    let args = Args::parse();
-
-    let analyzer = CoverageAnalyzer::new(&args.specs_dir, &args.scenarios_dir);
-    let report = analyzer.analyze()?;
-
-    match args.format.as_str() {
-        "json" => {
-            let json = serde_json::to_string_pretty(&report)?;
-            println!("{json}");
-        }
-        "text" => {
-            println!("Analyzing scenario coverage...");
-            print_text_report(&report);
-        }
-        _ => {
-            eprintln!("Unsupported format: {}", args.format);
-            return Err("Use 'json' or 'text'".into());
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(target_arch = "wasm32"))]
 fn print_text_report(report: &CoverageReport) {
     println!("\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
     println!("  SCENARIO COVERAGE REPORT");
     println!("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
     println!();

---- given_json_format_when_running_coverage_cli_then_stdout_is_pure_json stdout ----

thread 'given_json_format_when_running_coverage_cli_then_stdout_is_pure_json' (1353644) panicked at tests/coverage_cli_regressions.rs:70:19:
Expected valid JSON, got error: EOF while parsing a value at line 1 column 0

failures:
    given_json_format_when_running_coverage_cli_then_stdout_is_pure_json

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
