*** src/bin/coverage.rs:50:5: replace print_text_report with ()

*** mutation diff:
--- src/bin/coverage.rs
+++ replace print_text_report with ()
@@ -42,52 +42,13 @@
         }
     }
 
     Ok(())
 }
 
 #[cfg(not(target_arch = "wasm32"))]
 fn print_text_report(report: &CoverageReport) {
-    println!("\n━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
-    println!("  SCENARIO COVERAGE REPORT");
-    println!("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
-    println!();
-    println!("  Overall Coverage: {:.1}%", report.overall_coverage);
-    println!();
-    println!("  Spec Coverage:");
-    for spec in &report.specs {
-        println!(
-            "    {}: {:.1}% ({}/{} behaviors, {}/{} edge cases)",
-            spec.spec_id,
-            spec.coverage_percentage,
-            spec.covered_behaviors,
-            spec.total_behaviors,
-            spec.covered_edge_cases,
-            spec.total_edge_cases
-        );
-    }
-    println!();
-
-    if !report.common_gaps.is_empty() {
-        println!("  Common Coverage Gaps:");
-        for gap in &report.common_gaps {
-            println!("    - {gap}");
-        }
-    }
-
-    println!(
-        "\n  Totals: {} behaviors, {} edge cases",
-        report.total_behaviors, report.total_edge_cases
-    );
-    println!(
-        "  Covered: {} behaviors, {} edge cases",
-        report.covered_behaviors, report.covered_edge_cases
-    );
-    println!(
-        "  Missing: {} behaviors, {} edge cases",
-        report.total_behaviors - report.covered_behaviors,
-        report.total_edge_cases - report.covered_edge_cases
-    );
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_arch = "wasm32")]
 fn main() {}

*** result: Success
