*** src/bin/coverage.rs:70:8: delete ! in print_text_report

*** mutation diff:
--- src/bin/coverage.rs
+++ delete ! in print_text_report
@@ -62,17 +62,17 @@
             spec.covered_behaviors,
             spec.total_behaviors,
             spec.covered_edge_cases,
             spec.total_edge_cases
         );
     }
     println!();
 
-    if !report.common_gaps.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */report.common_gaps.is_empty() {
         println!("  Common Coverage Gaps:");
         for gap in &report.common_gaps {
             println!("    - {gap}");
         }
     }
 
     println!(
         "\n  Totals: {} behaviors, {} edge cases",

*** result: Success
