*** src/bin/flow_extend.rs:55:5: replace write_workflow -> Result<(), Box<dyn std::error::Error>> with Ok(())

*** mutation diff:
--- src/bin/flow_extend.rs
+++ replace write_workflow -> Result<(), Box<dyn std::error::Error>> with Ok(())
@@ -47,19 +47,17 @@
 fn parse_workflow(path: &PathBuf) -> Result<Workflow, Box<dyn std::error::Error>> {
     let content = std::fs::read_to_string(path)?;
     let workflow = serde_json::from_str::<Workflow>(&content)?;
     Ok(workflow)
 }
 
 #[cfg(not(target_arch = "wasm32"))]
 fn write_workflow(path: &PathBuf, workflow: &Workflow) -> Result<(), Box<dyn std::error::Error>> {
-    let content = serde_json::to_string_pretty(workflow)?;
-    std::fs::write(path, content)?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(target_arch = "wasm32"))]
 fn main() -> Result<(), Box<dyn std::error::Error>> {
     let cli = Cli::parse();
 
     match cli.command {
         Command::Suggest { workflow_path } => {

*** result: Success
