*** src/feedback/mod.rs:141:13: delete match arm 3 in FeedbackConfig::from_level

*** mutation diff:
--- src/feedback/mod.rs
+++ delete match arm 3 in FeedbackConfig::from_level
@@ -133,26 +133,17 @@
                 name: "categorical".to_string(),
                 includes_status_codes: false,
                 includes_bodies: false,
                 includes_timing: false,
                 includes_scenario_ids: false,
                 includes_step_sequences: false,
                 includes_exact_assertions: false,
             },
-            3 => Self {
-                level: FeedbackLevel::GUIDED,
-                name: "guided".to_string(),
-                includes_status_codes: false,
-                includes_bodies: false,
-                includes_timing: false,
-                includes_scenario_ids: false,
-                includes_step_sequences: false,
-                includes_exact_assertions: false,
-            },
+             /* ~ changed by cargo-mutants ~ */
             4 => Self {
                 level: FeedbackLevel::DIAGNOSTIC,
                 name: "diagnostic".to_string(),
                 includes_status_codes: true,
                 includes_bodies: false,
                 includes_timing: false,
                 includes_scenario_ids: false,
                 includes_step_sequences: false,

*** result: Success
