*** src/feedback/mod.rs:161:13: delete match arm 5 in FeedbackConfig::from_level

*** mutation diff:
--- src/feedback/mod.rs
+++ delete match arm 5 in FeedbackConfig::from_level
@@ -153,26 +153,17 @@
                 name: "diagnostic".to_string(),
                 includes_status_codes: true,
                 includes_bodies: false,
                 includes_timing: false,
                 includes_scenario_ids: false,
                 includes_step_sequences: false,
                 includes_exact_assertions: false,
             },
-            5 => Self {
-                level: FeedbackLevel::TRANSPARENT,
-                name: "transparent".to_string(),
-                includes_status_codes: true,
-                includes_bodies: true,
-                includes_timing: true,
-                includes_scenario_ids: true,
-                includes_step_sequences: true,
-                includes_exact_assertions: true,
-            },
+             /* ~ changed by cargo-mutants ~ */
             _ => Self::from_level(3),
         }
     }
 }
 
 #[derive(Debug, Clone, Serialize, Deserialize)]
 pub struct SanitizedFailure {
     pub category: FailureCategoryName,

*** result: Success
