*** src/feedback/mod.rs:251:56: delete ! in FeedbackSanitizer::categorize_failure

*** mutation diff:
--- src/feedback/mod.rs
+++ delete ! in FeedbackSanitizer::categorize_failure
@@ -243,17 +243,17 @@
             spec_ref: SpecRef::new(result.spec_ref.clone()),
             description,
             hint,
             spec_text,
         }
     }
 
     fn categorize_failure(result: &super::scenario_runner::ScenarioResult) -> FailureCategoryName {
-        let failed_step = result.steps.iter().find(|s| !s.passed);
+        let failed_step = result.steps.iter().find(|s|  /* ~ changed by cargo-mutants ~ */s.passed);
 
         if let Some(step) = failed_step {
             if step.error.as_ref().is_some_and(|e| e.contains("404")) {
                 return FailureCategoryName::new("Resource Not Found");
             }
             if step.error.as_ref().is_some_and(|e| e.contains("500")) {
                 return FailureCategoryName::new("Server Error");
             }

*** result: Success
