*** src/feedback/mod.rs:26:9: replace FeedbackLevel::value -> u8 with 0

*** mutation diff:
--- src/feedback/mod.rs
+++ replace FeedbackLevel::value -> u8 with 0
@@ -18,17 +18,17 @@
             3 => Ok(Self::GUIDED),
             4 => Ok(Self::DIAGNOSTIC),
             5 => Ok(Self::TRANSPARENT),
             _ => Err(FeedbackConfigError::InvalidLevel(level)),
         }
     }
 
     pub fn value(&self) -> u8 {
-        self.0
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_minimal(&self) -> bool {
         self.0 == Self::MINIMAL.0
     }
 
     pub fn is_transparent(&self) -> bool {
         self.0 == Self::TRANSPARENT.0

*** result: Success
