*** src/feedback/mod.rs:286:9: replace FeedbackSanitizer::generate_hint -> String with String::new()

*** mutation diff:
--- src/feedback/mod.rs
+++ replace FeedbackSanitizer::generate_hint -> String with String::new()
@@ -278,38 +278,17 @@
             "Resource Not Found" => "The system returns incorrect HTTP status codes for missing resources.".to_string(),
             "Server Error" => "The system returns internal server errors instead of handling the request properly.".to_string(),
             "Timeout" => "The system does not complete operations within expected time limits.".to_string(),
             _ => "A behavioral requirement is not satisfied.".to_string(),
         }
     }
 
     fn generate_hint(category: &FailureCategoryName) -> String {
-        match category.as_str() {
-            "Security Violation" => {
-                "Review the spec's security requirements and ensure all invariants are enforced."
-                    .to_string()
-            }
-            "Error Handling" => {
-                "Review edge cases in the spec and ensure proper error responses are returned."
-                    .to_string()
-            }
-            "Happy Path" => "Review the spec's acceptance criteria for this behavior.".to_string(),
-            "Resource Not Found" => {
-                "Ensure API endpoints return correct HTTP status codes per the spec.".to_string()
-            }
-            "Server Error" => {
-                "Check that all error conditions are handled before reaching internal logic."
-                    .to_string()
-            }
-            "Timeout" => {
-                "Review performance requirements in the spec's constraints section.".to_string()
-            }
-            _ => "Review the spec for the relevant behavior.".to_string(),
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn get_spec_text_reference(category: &FailureCategoryName) -> String {
         match category.as_str() {
             "Security Violation" => {
                 "Review context.invariants for security constraints.".to_string()
             }
             "Error Handling" => {

*** result: Success
