*** src/feedback/mod.rs:30:16: replace == with != in FeedbackLevel::is_minimal

*** mutation diff:
--- src/feedback/mod.rs
+++ replace == with != in FeedbackLevel::is_minimal
@@ -22,17 +22,17 @@
         }
     }
 
     pub fn value(&self) -> u8 {
         self.0
     }
 
     pub fn is_minimal(&self) -> bool {
-        self.0 == Self::MINIMAL.0
+        self.0 != /* ~ changed by cargo-mutants ~ */ Self::MINIMAL.0
     }
 
     pub fn is_transparent(&self) -> bool {
         self.0 == Self::TRANSPARENT.0
     }
 
     pub fn name(&self) -> &'static str {
         match self.0 {

*** result: Success
