*** src/feedback/mod.rs:30:9: replace FeedbackLevel::is_minimal -> bool with false

*** mutation diff:
--- src/feedback/mod.rs
+++ replace FeedbackLevel::is_minimal -> bool with false
@@ -22,17 +22,17 @@
         }
     }
 
     pub fn value(&self) -> u8 {
         self.0
     }
 
     pub fn is_minimal(&self) -> bool {
-        self.0 == Self::MINIMAL.0
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_transparent(&self) -> bool {
         self.0 == Self::TRANSPARENT.0
     }
 
     pub fn name(&self) -> &'static str {
         match self.0 {

*** result: Success
