*** src/feedback/mod.rs:311:9: replace FeedbackSanitizer::get_spec_text_reference -> String with "xyzzy".into()

*** mutation diff:
--- src/feedback/mod.rs
+++ replace FeedbackSanitizer::get_spec_text_reference -> String with "xyzzy".into()
@@ -303,26 +303,17 @@
             "Timeout" => {
                 "Review performance requirements in the spec's constraints section.".to_string()
             }
             _ => "Review the spec for the relevant behavior.".to_string(),
         }
     }
 
     fn get_spec_text_reference(category: &FailureCategoryName) -> String {
-        match category.as_str() {
-            "Security Violation" => {
-                "Review context.invariants for security constraints.".to_string()
-            }
-            "Error Handling" => {
-                "Review behaviors[].edge_cases for required error handling.".to_string()
-            }
-            "Happy Path" => "Review acceptance_criteria for the expected behavior.".to_string(),
-            _ => "Review the relevant behavior in the spec.".to_string(),
-        }
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[must_use]
 pub fn sanitize_results(
     raw_results: &[super::scenario_runner::ScenarioResult],
     iteration: u32,
     level: u8,

*** result: Success
