*** src/feedback/mod.rs:315:13: delete match arm "Error Handling" in FeedbackSanitizer::get_spec_text_reference

*** mutation diff:
--- src/feedback/mod.rs
+++ delete match arm "Error Handling" in FeedbackSanitizer::get_spec_text_reference
@@ -307,19 +307,17 @@
         }
     }
 
     fn get_spec_text_reference(category: &FailureCategoryName) -> String {
         match category.as_str() {
             "Security Violation" => {
                 "Review context.invariants for security constraints.".to_string()
             }
-            "Error Handling" => {
-                "Review behaviors[].edge_cases for required error handling.".to_string()
-            }
+             /* ~ changed by cargo-mutants ~ */
             "Happy Path" => "Review acceptance_criteria for the expected behavior.".to_string(),
             _ => "Review the relevant behavior in the spec.".to_string(),
         }
     }
 }
 
 #[must_use]
 pub fn sanitize_results(

*** result: Success
