*** src/feedback/mod.rs:34:16: replace == with != in FeedbackLevel::is_transparent

*** mutation diff:
--- src/feedback/mod.rs
+++ replace == with != in FeedbackLevel::is_transparent
@@ -26,17 +26,17 @@
         self.0
     }
 
     pub fn is_minimal(&self) -> bool {
         self.0 == Self::MINIMAL.0
     }
 
     pub fn is_transparent(&self) -> bool {
-        self.0 == Self::TRANSPARENT.0
+        self.0 != /* ~ changed by cargo-mutants ~ */ Self::TRANSPARENT.0
     }
 
     pub fn name(&self) -> &'static str {
         match self.0 {
             1 => "minimal",
             2 => "categorical",
             3 => "guided",
             4 => "diagnostic",

*** result: Success
