*** src/feedback/mod.rs:34:9: replace FeedbackLevel::is_transparent -> bool with true

*** mutation diff:
--- src/feedback/mod.rs
+++ replace FeedbackLevel::is_transparent -> bool with true
@@ -26,17 +26,17 @@
         self.0
     }
 
     pub fn is_minimal(&self) -> bool {
         self.0 == Self::MINIMAL.0
     }
 
     pub fn is_transparent(&self) -> bool {
-        self.0 == Self::TRANSPARENT.0
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn name(&self) -> &'static str {
         match self.0 {
             1 => "minimal",
             2 => "categorical",
             3 => "guided",
             4 => "diagnostic",

*** result: Success
