*** src/feedback/mod.rs:38:9: replace FeedbackLevel::name -> &'static str with "xyzzy"

*** mutation diff:
--- src/feedback/mod.rs
+++ replace FeedbackLevel::name -> &'static str with "xyzzy"
@@ -30,24 +30,17 @@
         self.0 == Self::MINIMAL.0
     }
 
     pub fn is_transparent(&self) -> bool {
         self.0 == Self::TRANSPARENT.0
     }
 
     pub fn name(&self) -> &'static str {
-        match self.0 {
-            1 => "minimal",
-            2 => "categorical",
-            3 => "guided",
-            4 => "diagnostic",
-            5 => "transparent",
-            _ => "unknown",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq, Hash, Serialize, Deserialize)]
 pub struct FailureCategoryName(String);
 
 impl FailureCategoryName {
     pub fn new(name: impl Into<String>) -> Self {

*** result: Success
