*** src/feedback/mod.rs:40:13: delete match arm 2 in FeedbackLevel::name

*** mutation diff:
--- src/feedback/mod.rs
+++ delete match arm 2 in FeedbackLevel::name
@@ -32,17 +32,17 @@
 
     pub fn is_transparent(&self) -> bool {
         self.0 == Self::TRANSPARENT.0
     }
 
     pub fn name(&self) -> &'static str {
         match self.0 {
             1 => "minimal",
-            2 => "categorical",
+             /* ~ changed by cargo-mutants ~ */
             3 => "guided",
             4 => "diagnostic",
             5 => "transparent",
             _ => "unknown",
         }
     }
 }

*** result: Success
