*** src/feedback/mod.rs:41:13: delete match arm 3 in FeedbackLevel::name

*** mutation diff:
--- src/feedback/mod.rs
+++ delete match arm 3 in FeedbackLevel::name
@@ -33,17 +33,17 @@
     pub fn is_transparent(&self) -> bool {
         self.0 == Self::TRANSPARENT.0
     }
 
     pub fn name(&self) -> &'static str {
         match self.0 {
             1 => "minimal",
             2 => "categorical",
-            3 => "guided",
+             /* ~ changed by cargo-mutants ~ */
             4 => "diagnostic",
             5 => "transparent",
             _ => "unknown",
         }
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq, Hash, Serialize, Deserialize)]

*** result: Success
