*** src/feedback/mod.rs:43:13: delete match arm 5 in FeedbackLevel::name

*** mutation diff:
--- src/feedback/mod.rs
+++ delete match arm 5 in FeedbackLevel::name
@@ -35,17 +35,17 @@
     }
 
     pub fn name(&self) -> &'static str {
         match self.0 {
             1 => "minimal",
             2 => "categorical",
             3 => "guided",
             4 => "diagnostic",
-            5 => "transparent",
+             /* ~ changed by cargo-mutants ~ */
             _ => "unknown",
         }
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq, Hash, Serialize, Deserialize)]
 pub struct FailureCategoryName(String);

*** result: Success
