*** src/flow_extender/mod.rs:1022:5: replace plan_for_key -> Option<RulePlan> with None

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace plan_for_key -> Option<RulePlan> with None
@@ -1014,24 +1014,17 @@
 fn endpoint_signature(endpoint: PatchEndpoint) -> String {
     match endpoint {
         PatchEndpoint::Existing(node_id) => format!("e:{node_id}"),
         PatchEndpoint::Proposed(index) => format!("p:{index}"),
     }
 }
 
 fn plan_for_key(workflow: &Workflow, key: ExtensionKey) -> Option<RulePlan> {
-    if !key_is_compatible_with_workflow(workflow, key) {
-        return None;
-    }
-
-    rules()
-        .into_iter()
-        .find(|candidate| candidate.key == key)
-        .and_then(|rule| (rule.plan)(workflow))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn key_is_compatible_with_workflow(workflow: &Workflow, key: ExtensionKey) -> bool {
     let inferred_kinds = infer_workflow_service_kinds(workflow);
     let compatible_kinds = extension_semantics(key)
         .compatible_service_kinds
         .into_iter()
         .collect::<HashSet<_>>();

---- flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent stdout ----

thread 'flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent' (1928955) panicked at src/flow_extender/mod.rs:1682:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added stdout ----

thread 'flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added' (1928944) panicked at src/flow_extender/mod.rs:1520:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::HttpHandler(_)))

---- flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge stdout ----

thread 'flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge' (1928956) panicked at src/flow_extender/mod.rs:1577:9:
assertion failed: preview.is_some()

failures:
    flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent
    flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent
    flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 452 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
