*** src/flow_extender/mod.rs:1028:41: replace == with != in plan_for_key

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace == with != in plan_for_key
@@ -1020,17 +1020,17 @@
 
 fn plan_for_key(workflow: &Workflow, key: ExtensionKey) -> Option<RulePlan> {
     if !key_is_compatible_with_workflow(workflow, key) {
         return None;
     }
 
     rules()
         .into_iter()
-        .find(|candidate| candidate.key == key)
+        .find(|candidate| candidate.key != /* ~ changed by cargo-mutants ~ */ key)
         .and_then(|rule| (rule.plan)(workflow))
 }
 
 fn key_is_compatible_with_workflow(workflow: &Workflow, key: ExtensionKey) -> bool {
     let inferred_kinds = infer_workflow_service_kinds(workflow);
     let compatible_kinds = extension_semantics(key)
         .compatible_service_kinds
         .into_iter()

---- flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added stdout ----

thread 'flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added' (1933699) panicked at src/flow_extender/mod.rs:1527:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::HttpHandler(_)))

---- flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge stdout ----

thread 'flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge' (1933711) panicked at src/flow_extender/mod.rs:1590:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent stdout ----

thread 'flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent' (1933710) panicked at src/flow_extender/mod.rs:1703:9:
assertion failed: timeout.is_some()

failures:
    flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent
    flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge

test result: FAILED. 454 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
