*** src/flow_extender/mod.rs:1033:5: replace key_is_compatible_with_workflow -> bool with true

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace key_is_compatible_with_workflow -> bool with true
@@ -1025,22 +1025,17 @@
 
     rules()
         .into_iter()
         .find(|candidate| candidate.key == key)
         .and_then(|rule| (rule.plan)(workflow))
 }
 
 fn key_is_compatible_with_workflow(workflow: &Workflow, key: ExtensionKey) -> bool {
-    let inferred_kinds = infer_workflow_service_kinds(workflow);
-    let compatible_kinds = extension_semantics(key)
-        .compatible_service_kinds
-        .into_iter()
-        .collect::<HashSet<_>>();
-    !inferred_kinds.is_disjoint(&compatible_kinds)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn infer_workflow_service_kinds(workflow: &Workflow) -> HashSet<RestateServiceKind> {
     let has_promise_semantics = workflow.nodes.iter().any(|node| {
         matches!(
             node.node,
             WorkflowNode::DurablePromise(_) | WorkflowNode::ResolvePromise(_)
         ) || is_signal_wait_anchor(workflow, node)

---- reliability_bundle_preview_contract_respects_service_semantics stdout ----

thread 'reliability_bundle_preview_contract_respects_service_semantics' (1938302) panicked at tests/flow_extender_contracts.rs:238:5:
assertion failed: preview.nodes.iter().all(|node| node.node_type != "set-state")

failures:
    reliability_bundle_preview_contract_respects_service_semantics

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
