*** src/flow_extender/mod.rs:1033:5: replace key_is_compatible_with_workflow -> bool with false

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace key_is_compatible_with_workflow -> bool with false
@@ -1025,22 +1025,17 @@
 
     rules()
         .into_iter()
         .find(|candidate| candidate.key == key)
         .and_then(|rule| (rule.plan)(workflow))
 }
 
 fn key_is_compatible_with_workflow(workflow: &Workflow, key: ExtensionKey) -> bool {
-    let inferred_kinds = infer_workflow_service_kinds(workflow);
-    let compatible_kinds = extension_semantics(key)
-        .compatible_service_kinds
-        .into_iter()
-        .collect::<HashSet<_>>();
-    !inferred_kinds.is_disjoint(&compatible_kinds)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn infer_workflow_service_kinds(workflow: &Workflow) -> HashSet<RestateServiceKind> {
     let has_promise_semantics = workflow.nodes.iter().any(|node| {
         matches!(
             node.node,
             WorkflowNode::DurablePromise(_) | WorkflowNode::ResolvePromise(_)
         ) || is_signal_wait_anchor(workflow, node)

---- flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported stdout ----

thread 'flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported' (1941983) panicked at src/flow_extender/mod.rs:1662:9:
assertion failed: bundle.is_some()

---- flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent stdout ----

thread 'flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent' (1941984) panicked at src/flow_extender/mod.rs:1727:9:
assertion failed: !initial.created_nodes.is_empty()

---- flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic stdout ----

thread 'flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic' (1941991) panicked at src/flow_extender/mod.rs:1601:9:
assertion failed: entry.is_some()

failures:
    flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported
    flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent
    flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added
    flow_extender::tests::given_empty_workflow_when_suggesting_then_entry_trigger_is_recommended
    flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent
    flow_extender::tests::given_timeout_guard_preview_when_rule

test result: FAILED. 448 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
