*** src/flow_extender/mod.rs:103:9: replace ExtensionKey::as_str -> &'static str with "xyzzy"

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace ExtensionKey::as_str -> &'static str with "xyzzy"
@@ -95,24 +95,17 @@
             _ => Err(format!("Unknown extension preset key: {value}")),
         }
     }
 }
 
 impl ExtensionKey {
     #[must_use]
     pub const fn as_str(self) -> &'static str {
-        match self {
-            Self::AddEntryTrigger => "add-entry-trigger",
-            Self::AddReliabilityBundle => "add-reliability-bundle",
-            Self::AddTimeoutGuard => "add-timeout-guard",
-            Self::AddDurableCheckpoint => "add-durable-checkpoint",
-            Self::AddCompensationBranch => "add-compensation-branch",
-            Self::AddSignalResolution => "add-signal-resolution",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromStr for ExtensionKey {
     type Err = String;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         match value {

---- flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent stdout ----

thread 'flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent' (1714670) panicked at src/flow_extender/mod.rs:1720:9:
assertion failed: initial.is_ok()

---- flow_extender::tests::given_dependency_graph_when_ordering_then_prerequisites_come_first stdout ----

thread 'flow_extender::tests::given_dependency_graph_when_ordering_then_prerequisites_come_first' (1714671) panicked at src/flow_extender/mod.rs:1810:9:
assertion `left == right` failed
  left: ["xyzzy", "xyzzy", "xyzzy"]
 right: ["add-entry-trigger", "add-timeout-guard", "add-durable-checkpoint"]

---- flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported stdout ----

thread 'flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported' (1714669) panicked at src/flow_extender/mod.rs:1660:9:
assertion failed: bundle.is_some()

failures:
    flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported
    flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent
    flow_extender::tests::given_dependency_graph_when_ordering_then_prerequisites_come_first
    flow_extender::tests::given_empty_workflow_when_suggesting_then_entry_trigger_is_recommended
    flow_extender::tests::given_known_extension_keys_when_parsing_then_all_are_unique_and_valid
    flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order
    flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bun

test result: FAILED. 448 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
