*** src/flow_extender/mod.rs:119:13: delete match arm "add-entry-trigger" in <impl FromStr for ExtensionKey>::from_str

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete match arm "add-entry-trigger" in <impl FromStr for ExtensionKey>::from_str
@@ -111,17 +111,17 @@
     }
 }
 
 impl FromStr for ExtensionKey {
     type Err = String;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         match value {
-            "add-entry-trigger" => Ok(Self::AddEntryTrigger),
+             /* ~ changed by cargo-mutants ~ */
             "add-reliability-bundle" => Ok(Self::AddReliabilityBundle),
             "add-timeout-guard" => Ok(Self::AddTimeoutGuard),
             "add-durable-checkpoint" => Ok(Self::AddDurableCheckpoint),
             "add-compensation-branch" => Ok(Self::AddCompensationBranch),
             "add-signal-resolution" => Ok(Self::AddSignalResolution),
             _ => Err(format!("Unknown extension key: {value}")),
         }
     }

---- flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added stdout ----

thread 'flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added' (1715749) panicked at src/flow_extender/mod.rs:1526:9:
assertion failed: applied.is_ok()

---- flow_extender::tests::given_dependency_graph_when_ordering_then_prerequisites_come_first stdout ----

thread 'flow_extender::tests::given_dependency_graph_when_ordering_then_prerequisites_come_first' (1715747) panicked at src/flow_extender/mod.rs:1812:9:
assertion failed: graph.is_ok()

---- flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order stdout ----

thread 'flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order' (1715756) panicked at src/flow_extender/mod.rs:1863:9:
assertion failed: resolved.is_ok()

failures:
    flow_extender::tests::given_dependency_graph_when_ordering_then_prerequisites_come_first
    flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 453 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
