*** src/flow_extender/mod.rs:120:13: delete match arm "add-reliability-bundle" in <impl FromStr for ExtensionKey>::from_str

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete match arm "add-reliability-bundle" in <impl FromStr for ExtensionKey>::from_str
@@ -112,17 +112,17 @@
 }
 
 impl FromStr for ExtensionKey {
     type Err = String;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         match value {
             "add-entry-trigger" => Ok(Self::AddEntryTrigger),
-            "add-reliability-bundle" => Ok(Self::AddReliabilityBundle),
+             /* ~ changed by cargo-mutants ~ */
             "add-timeout-guard" => Ok(Self::AddTimeoutGuard),
             "add-durable-checkpoint" => Ok(Self::AddDurableCheckpoint),
             "add-compensation-branch" => Ok(Self::AddCompensationBranch),
             "add-signal-resolution" => Ok(Self::AddSignalResolution),
             _ => Err(format!("Unknown extension key: {value}")),
         }
     }
 }

---- flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent stdout ----

thread 'flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent' (1716710) panicked at src/flow_extender/mod.rs:1727:9:
assertion failed: initial.is_ok()

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1716718) panicked at src/flow_extender/mod.rs:1844:9:
assertion failed: plan.is_ok()

failures:
    flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
