*** src/flow_extender/mod.rs:121:13: delete match arm "add-timeout-guard" in <impl FromStr for ExtensionKey>::from_str

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete match arm "add-timeout-guard" in <impl FromStr for ExtensionKey>::from_str
@@ -113,17 +113,17 @@
 
 impl FromStr for ExtensionKey {
     type Err = String;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         match value {
             "add-entry-trigger" => Ok(Self::AddEntryTrigger),
             "add-reliability-bundle" => Ok(Self::AddReliabilityBundle),
-            "add-timeout-guard" => Ok(Self::AddTimeoutGuard),
+             /* ~ changed by cargo-mutants ~ */
             "add-durable-checkpoint" => Ok(Self::AddDurableCheckpoint),
             "add-compensation-branch" => Ok(Self::AddCompensationBranch),
             "add-signal-resolution" => Ok(Self::AddSignalResolution),
             _ => Err(format!("Unknown extension key: {value}")),
         }
     }
 }

---- flow_extender::tests::given_duplicate_requested_keys_when_detecting_conflicts_then_duplicate_is_reported stdout ----

thread 'flow_extender::tests::given_duplicate_requested_keys_when_detecting_conflicts_then_duplicate_is_reported' (1717261) panicked at src/flow_extender/mod.rs:1754:9:
assertion failed: conflicts.is_ok()

---- flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent stdout ----

thread 'flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent' (1717259) panicked at src/flow_extender/mod.rs:1727:9:
assertion failed: initial.is_ok()

---- flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order stdout ----

thread 'flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order' (1717269) panicked at src/flow_extender/mod.rs:1863:9:
assertion failed: resolved.is_ok()

failures:
    flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent
    flow_extender::tests::given_dependency_graph_when_ordering_then_prerequisites_come_first
    flow_extender::tests::given_duplicate_requested_keys_when_detecting_conflicts_then_duplicate_is_reported
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent
    flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 450 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
