*** src/flow_extender/mod.rs:123:13: delete match arm "add-compensation-branch" in <impl FromStr for ExtensionKey>::from_str

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete match arm "add-compensation-branch" in <impl FromStr for ExtensionKey>::from_str
@@ -115,17 +115,17 @@
     type Err = String;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         match value {
             "add-entry-trigger" => Ok(Self::AddEntryTrigger),
             "add-reliability-bundle" => Ok(Self::AddReliabilityBundle),
             "add-timeout-guard" => Ok(Self::AddTimeoutGuard),
             "add-durable-checkpoint" => Ok(Self::AddDurableCheckpoint),
-            "add-compensation-branch" => Ok(Self::AddCompensationBranch),
+             /* ~ changed by cargo-mutants ~ */
             "add-signal-resolution" => Ok(Self::AddSignalResolution),
             _ => Err(format!("Unknown extension key: {value}")),
         }
     }
 }
 
 #[derive(Debug, Clone, Serialize, Deserialize, PartialEq, Eq)]
 pub struct RuleContract {

---- flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent stdout ----

thread 'flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent' (1730653) panicked at src/flow_extender/mod.rs:1727:9:
assertion failed: initial.is_ok()

---- flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order stdout ----

thread 'flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order' (1730663) panicked at src/flow_extender/mod.rs:1863:9:
assertion failed: resolved.is_ok()

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1730661) panicked at src/flow_extender/mod.rs:1844:9:
assertion failed: plan.is_ok()

failures:
    flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order

test result: FAILED. 455 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
