*** src/flow_extender/mod.rs:124:13: delete match arm "add-signal-resolution" in <impl FromStr for ExtensionKey>::from_str

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete match arm "add-signal-resolution" in <impl FromStr for ExtensionKey>::from_str
@@ -116,17 +116,17 @@
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         match value {
             "add-entry-trigger" => Ok(Self::AddEntryTrigger),
             "add-reliability-bundle" => Ok(Self::AddReliabilityBundle),
             "add-timeout-guard" => Ok(Self::AddTimeoutGuard),
             "add-durable-checkpoint" => Ok(Self::AddDurableCheckpoint),
             "add-compensation-branch" => Ok(Self::AddCompensationBranch),
-            "add-signal-resolution" => Ok(Self::AddSignalResolution),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(format!("Unknown extension key: {value}")),
         }
     }
 }
 
 #[derive(Debug, Clone, Serialize, Deserialize, PartialEq, Eq)]
 pub struct RuleContract {
     pub preconditions: Vec<String>,

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1731900) panicked at src/flow_extender/mod.rs:1844:9:
assertion failed: plan.is_ok()

---- flow_extender::tests::given_service_context_when_detecting_conflicts_then_semantic_mismatch_is_reported stdout ----

thread 'flow_extender::tests::given_service_context_when_detecting_conflicts_then_semantic_mismatch_is_reported' (1731904) panicked at src/flow_extender/mod.rs:1772:9:
assertion failed: conflicts.is_ok()

failures:
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_service_context_when_detecting_conflicts_then_semantic_mismatch_is_reported

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
