*** src/flow_extender/mod.rs:335:20: delete ! in suggest_extensions

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete ! in suggest_extensions
@@ -327,17 +327,17 @@
 }
 
 #[must_use]
 pub fn suggest_extensions(workflow: &Workflow) -> Vec<FlowExtension> {
     hide_isolated_reliability_hints(
         rules()
             .into_iter()
             .filter_map(|rule| {
-                if !key_is_compatible_with_workflow(workflow, rule.key) {
+                if  /* ~ changed by cargo-mutants ~ */key_is_compatible_with_workflow(workflow, rule.key) {
                     return None;
                 }
                 (rule.plan)(workflow).map(|rule_plan| FlowExtension {
                     key: rule.key.as_str().to_string(),
                     title: rule.title.to_string(),
                     rationale: rule_plan.rationale,
                     priority: rule.priority,
                     contract: rule.contract,

---- flow_extender::tests::given_empty_workflow_when_suggesting_then_entry_trigger_is_recommended stdout ----

thread 'flow_extender::tests::given_empty_workflow_when_suggesting_then_entry_trigger_is_recommended' (1742765) panicked at src/flow_extender/mod.rs:1515:9:
assertion failed: suggestions.iter().any(|item| item.key == "add-entry-trigger")

---- flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints stdout ----

thread 'flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints' (1742774) panicked at src/flow_extender/mod.rs:1638:9:
assertion failed: keys.contains(&"add-reliability-bundle")

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1742769) panicked at src/flow_extender/mod.rs:1849:9:
assertion failed: plan.steps.len() >= 3

failures:
    flow_extender::tests::given_empty_workflow_when_suggesting_then_entry_trigger_is_recommended
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints

test result: FAILED. 455 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
