*** src/flow_extender/mod.rs:352:5: replace suggest_extensions_with_analysis -> Vec<ExtensionSuggestionAnalysis> with vec![]

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace suggest_extensions_with_analysis -> Vec<ExtensionSuggestionAnalysis> with vec![]
@@ -344,37 +344,17 @@
                 })
             })
             .collect(),
     )
 }
 
 #[must_use]
 pub fn suggest_extensions_with_analysis(workflow: &Workflow) -> Vec<ExtensionSuggestionAnalysis> {
-    hide_isolated_reliability_analysis(
-        rules()
-            .into_iter()
-            .filter_map(|rule| {
-                if !key_is_compatible_with_workflow(workflow, rule.key) {
-                    return None;
-                }
-                (rule.plan)(workflow).map(|plan| ExtensionSuggestionAnalysis {
-                    key: rule.key.as_str().to_string(),
-                    score: confidence_score_for(rule.key, workflow),
-                    rationale_class: rationale_class_for(rule.key),
-                    fingerprint: extension_fingerprint(rule.key, &plan.patch),
-                    dependencies: extension_dependencies(rule.key)
-                        .iter()
-                        .map(|dependency| dependency.as_str().to_string())
-                        .collect(),
-                    semantics: extension_semantics(rule.key),
-                })
-            })
-            .collect(),
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn preview_extension(
     workflow: &Workflow,
     key: &str,
 ) -> Result<Option<ExtensionPatchPreview>, String> {
     let parsed_key = ExtensionKey::from_str(key)?;

---- flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported stdout ----

thread 'flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported' (1748020) panicked at src/flow_extender/mod.rs:1647:9:
assertion failed: bundle.is_some()

---- flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic stdout ----

thread 'flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic' (1748028) panicked at src/flow_extender/mod.rs:1586:9:
assertion failed: entry.is_some()

failures:
    flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported
    flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
