*** src/flow_extender/mod.rs:379:5: replace preview_extension -> Result<Option<ExtensionPatchPreview>, String> with Ok(None)

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace preview_extension -> Result<Option<ExtensionPatchPreview>, String> with Ok(None)
@@ -371,20 +371,17 @@
             .collect(),
     )
 }
 
 pub fn preview_extension(
     workflow: &Workflow,
     key: &str,
 ) -> Result<Option<ExtensionPatchPreview>, String> {
-    let parsed_key = ExtensionKey::from_str(key)?;
-
-    Ok(plan_for_key(workflow, parsed_key)
-        .map(|plan| preview_from_patch(key.to_string(), &plan.patch)))
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn apply_extension(workflow: &mut Workflow, key: &str) -> Result<AppliedExtension, String> {
     let parsed_key = ExtensionKey::from_str(key)?;
     if parsed_key == ExtensionKey::AddReliabilityBundle {
         return apply_reliability_bundle(workflow, key);
     }

---- flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge stdout ----

thread 'flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge' (1755157) panicked at src/flow_extender/mod.rs:1581:9:
assertion failed: preview.is_some()

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1755150) panicked at src/flow_extender/mod.rs:1846:9:
assertion failed: plan.steps.len() >= 3

failures:
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
