*** src/flow_extender/mod.rs:37:9: replace ExtensionPresetKey::as_str -> &'static str with ""

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace ExtensionPresetKey::as_str -> &'static str with ""
@@ -29,21 +29,17 @@
     Webhook,
     Approval,
     RetrySaga,
 }
 
 impl ExtensionPresetKey {
     #[must_use]
     pub const fn as_str(self) -> &'static str {
-        match self {
-            Self::Webhook => "webhook",
-            Self::Approval => "approval",
-            Self::RetrySaga => "retry-saga",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn title(self) -> &'static str {
         match self {
             Self::Webhook => "Webhook Reliability",
             Self::Approval => "Approval Gate",
             Self::RetrySaga => "Retry Saga",

---- flow_extender::tests::given_presets_when_listing_then_expected_keys_exist stdout ----

thread 'flow_extender::tests::given_presets_when_listing_then_expected_keys_exist' (1670585) panicked at src/flow_extender/mod.rs:1913:9:
assertion failed: presets.iter().any(|preset| preset.key == "webhook")

---- flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order stdout ----

thread 'flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order' (1670586) panicked at src/flow_extender/mod.rs:1864:9:
assertion `left == right` failed
  left: ""
 right: "retry-saga"

failures:
    flow_extender::tests::given_presets_when_listing_then_expected_keys_exist
    flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
