*** src/flow_extender/mod.rs:412:5: replace detect_extension_conflicts -> Result<Vec<ExtensionConflict>, String> with Ok(vec![])

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace detect_extension_conflicts -> Result<Vec<ExtensionConflict>, String> with Ok(vec![])
@@ -404,82 +404,17 @@
         created_nodes,
     })
 }
 
 pub fn detect_extension_conflicts(
     workflow: &Workflow,
     keys: &[String],
 ) -> Result<Vec<ExtensionConflict>, String> {
-    let mut conflicts = Vec::new();
-    let mut seen: HashSet<ExtensionKey> = HashSet::new();
-    let mut fingerprint_map: HashMap<String, String> = HashMap::new();
-
-    for raw_key in keys {
-        let key = ExtensionKey::from_str(raw_key)?;
-        if !seen.insert(key) {
-            conflicts.push(ExtensionConflict {
-                left_key: raw_key.clone(),
-                right_key: raw_key.clone(),
-                kind: ConflictKind::DuplicateKey,
-                reason: "Extension key is duplicated in the request.".to_string(),
-            });
-        }
-
-        if let Some(plan) = plan_for_key(workflow, key) {
-            let fingerprint = extension_fingerprint(key, &plan.patch);
-            if let Some(existing_key) = fingerprint_map.get(&fingerprint) {
-                conflicts.push(ExtensionConflict {
-                    left_key: existing_key.clone(),
-                    right_key: raw_key.clone(),
-                    kind: ConflictKind::DuplicateFingerprint,
-                    reason: "Two extensions resolve to the same patch fingerprint.".to_string(),
-                });
-            } else {
-                let _ = fingerprint_map.insert(fingerprint, raw_key.clone());
-            }
-        }
-    }
-
-    for left_index in 0..keys.len() {
-        for right_index in (left_index + 1)..keys.len() {
-            let left_key = ExtensionKey::from_str(&keys[left_index])?;
-            let right_key = ExtensionKey::from_str(&keys[right_index])?;
-            if !have_shared_service_kind(left_key, right_key) {
-                conflicts.push(ExtensionConflict {
-                    left_key: keys[left_index].clone(),
-                    right_key: keys[right_index].clone(),
-                    kind: ConflictKind::SemanticIncompatibility,
-                    reason: "Requested extensions target incompatible Restate service kinds."
-                        .to_string(),
-                });
-            }
-        }
-    }
-
-    let inferred_kinds = infer_workflow_service_kinds(workflow);
-    for raw_key in keys {
-        let key = ExtensionKey::from_str(raw_key)?;
-        let supported_kinds = extension_semantics(key)
-            .compatible_service_kinds
-            .into_iter()
-            .collect::<HashSet<_>>();
-        if inferred_kinds.is_disjoint(&supported_kinds) {
-            conflicts.push(ExtensionConflict {
-                left_key: raw_key.clone(),
-                right_key: raw_key.clone(),
-                kind: ConflictKind::WorkflowSemanticMismatch,
-                reason:
-                    "Extension is incompatible with inferred Restate service/object/workflow context."
-                        .to_string(),
-            });
-        }
-    }
-
-    Ok(conflicts)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn extension_dependency_graph(keys: &[String]) -> Result<ExtensionDependencyGraph, String> {
     let parsed_keys = parse_unique_keys(keys)?;
     let edges = parsed_keys
         .iter()
         .flat_map(|key| {
             extension_dependencies(*key)

---- flow_extender::tests::given_duplicate_requested_keys_when_detecting_conflicts_then_duplicate_is_reported stdout ----

thread 'flow_extender::tests::given_duplicate_requested_keys_when_detecting_conflicts_then_duplicate_is_reported' (1762893) panicked at src/flow_extender/mod.rs:1694:9:
assertion failed: conflicts.iter().any(|conflict| conflict.reason.contains("duplicated"))

---- flow_extender::tests::given_service_context_when_detecting_conflicts_then_semantic_mismatch_is_reported stdout ----

thread 'flow_extender::tests::given_service_context_when_detecting_conflicts_then_semantic_mismatch_is_reported' (1762903) panicked at src/flow_extender/mod.rs:1712:9:
assertion failed: conflicts.iter().any(|conflict|
        conflict.kind == ConflictKind::WorkflowSemanticMismatch)

failures:
    flow_extender::tests::given_duplicate_requested_keys_when_detecting_conflicts_then_duplicate_is_reported
    flow_extender::tests::given_service_context_when_detecting_conflicts_then_semantic_mismatch_is_reported

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
