*** src/flow_extender/mod.rs:418:12: delete ! in detect_extension_conflicts

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete ! in detect_extension_conflicts
@@ -410,17 +410,17 @@
     keys: &[String],
 ) -> Result<Vec<ExtensionConflict>, String> {
     let mut conflicts = Vec::new();
     let mut seen: HashSet<ExtensionKey> = HashSet::new();
     let mut fingerprint_map: HashMap<String, String> = HashMap::new();
 
     for raw_key in keys {
         let key = ExtensionKey::from_str(raw_key)?;
-        if !seen.insert(key) {
+        if  /* ~ changed by cargo-mutants ~ */seen.insert(key) {
             conflicts.push(ExtensionConflict {
                 left_key: raw_key.clone(),
                 right_key: raw_key.clone(),
                 kind: ConflictKind::DuplicateKey,
                 reason: "Extension key is duplicated in the request.".to_string(),
             });
         }

---- flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order stdout ----

thread 'flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order' (1764530) panicked at src/flow_extender/mod.rs:1878:9:
assertion failed: resolved.conflicts.is_empty()

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1764528) panicked at src/flow_extender/mod.rs:1854:9:
assertion failed: plan.conflicts.is_empty()

failures:
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
