*** src/flow_extender/mod.rs:443:40: replace + with - in detect_extension_conflicts

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace + with - in detect_extension_conflicts
@@ -435,17 +435,17 @@
                 });
             } else {
                 let _ = fingerprint_map.insert(fingerprint, raw_key.clone());
             }
         }
     }
 
     for left_index in 0..keys.len() {
-        for right_index in (left_index + 1)..keys.len() {
+        for right_index in (left_index - /* ~ changed by cargo-mutants ~ */ 1)..keys.len() {
             let left_key = ExtensionKey::from_str(&keys[left_index])?;
             let right_key = ExtensionKey::from_str(&keys[right_index])?;
             if !have_shared_service_kind(left_key, right_key) {
                 conflicts.push(ExtensionConflict {
                     left_key: keys[left_index].clone(),
                     right_key: keys[right_index].clone(),
                     kind: ConflictKind::SemanticIncompatibility,
                     reason: "Requested extensions target incompatible Restate service kinds."

---- flow_extender::tests::given_duplicate_requested_keys_when_detecting_conflicts_then_duplicate_is_reported stdout ----

thread 'flow_extender::tests::given_duplicate_requested_keys_when_detecting_conflicts_then_duplicate_is_reported' (1770471) panicked at src/flow_extender/mod.rs:443:28:
attempt to subtract with overflow

---- flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order stdout ----

thread 'flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order' (1770479) panicked at src/flow_extender/mod.rs:443:28:
attempt to subtract with overflow

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1770477) panicked at src/flow_extender/mod.rs:443:28:
attempt to subtract with overflow

failures:
    flow_extender::tests::given_duplicate_requested_keys_when_detecting_conflicts_then_duplicate_is_reported
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order
    flow_extender::tests::given_service_context_when_detecting_conflicts_then_semantic_mismatch_is_reported
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 453 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
