*** src/flow_extender/mod.rs:443:40: replace + with * in detect_extension_conflicts

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace + with * in detect_extension_conflicts
@@ -435,17 +435,17 @@
                 });
             } else {
                 let _ = fingerprint_map.insert(fingerprint, raw_key.clone());
             }
         }
     }
 
     for left_index in 0..keys.len() {
-        for right_index in (left_index + 1)..keys.len() {
+        for right_index in (left_index * /* ~ changed by cargo-mutants ~ */ 1)..keys.len() {
             let left_key = ExtensionKey::from_str(&keys[left_index])?;
             let right_key = ExtensionKey::from_str(&keys[right_index])?;
             if !have_shared_service_kind(left_key, right_key) {
                 conflicts.push(ExtensionConflict {
                     left_key: keys[left_index].clone(),
                     right_key: keys[right_index].clone(),
                     kind: ConflictKind::SemanticIncompatibility,
                     reason: "Requested extensions target incompatible Restate service kinds."

*** result: Success
