*** src/flow_extender/mod.rs:446:16: delete ! in detect_extension_conflicts

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete ! in detect_extension_conflicts
@@ -438,17 +438,17 @@
             }
         }
     }
 
     for left_index in 0..keys.len() {
         for right_index in (left_index + 1)..keys.len() {
             let left_key = ExtensionKey::from_str(&keys[left_index])?;
             let right_key = ExtensionKey::from_str(&keys[right_index])?;
-            if !have_shared_service_kind(left_key, right_key) {
+            if  /* ~ changed by cargo-mutants ~ */have_shared_service_kind(left_key, right_key) {
                 conflicts.push(ExtensionConflict {
                     left_key: keys[left_index].clone(),
                     right_key: keys[right_index].clone(),
                     kind: ConflictKind::SemanticIncompatibility,
                     reason: "Requested extensions target incompatible Restate service kinds."
                         .to_string(),
                 });
             }

---- flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order stdout ----

thread 'flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order' (1776091) panicked at src/flow_extender/mod.rs:1878:9:
assertion failed: resolved.conflicts.is_empty()

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1776089) panicked at src/flow_extender/mod.rs:1854:9:
assertion failed: plan.conflicts.is_empty()

failures:
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
