*** src/flow_extender/mod.rs:557:5: replace extension_presets -> Vec<ExtensionPreset> with vec![]

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace extension_presets -> Vec<ExtensionPreset> with vec![]
@@ -549,33 +549,17 @@
             .collect(),
         conflicts,
         steps,
     })
 }
 
 #[must_use]
 pub fn extension_presets() -> Vec<ExtensionPreset> {
-    [
-        ExtensionPresetKey::Webhook,
-        ExtensionPresetKey::Approval,
-        ExtensionPresetKey::RetrySaga,
-    ]
-    .iter()
-    .map(|preset_key| ExtensionPreset {
-        key: preset_key.as_str().to_string(),
-        title: preset_key.title().to_string(),
-        description: preset_key.description().to_string(),
-        extension_keys: preset_key
-            .extension_keys()
-            .iter()
-            .map(|key| key.as_str().to_string())
-            .collect(),
-    })
-    .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn resolve_extension_preset(
     workflow: &Workflow,
     preset_key: &str,
 ) -> Result<ResolvedExtensionPreset, String> {
     let parsed_preset = ExtensionPresetKey::from_str(preset_key)?;
     let expanded_keys = expand_keys_with_dependencies(parsed_preset.extension_keys());

---- flow_extender::tests::given_presets_when_listing_then_expected_keys_exist stdout ----

thread 'flow_extender::tests::given_presets_when_listing_then_expected_keys_exist' (1783191) panicked at src/flow_extender/mod.rs:1900:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    flow_extender::tests::given_presets_when_listing_then_expected_keys_exist

test result: FAILED. 457 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
