*** src/flow_extender/mod.rs:55:9: replace ExtensionPresetKey::description -> &'static str with ""

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace ExtensionPresetKey::description -> &'static str with ""
@@ -47,27 +47,17 @@
             Self::Webhook => "Webhook Reliability",
             Self::Approval => "Approval Gate",
             Self::RetrySaga => "Retry Saga",
         }
     }
 
     #[must_use]
     pub const fn description(self) -> &'static str {
-        match self {
-            Self::Webhook => {
-                "Bootstraps webhook entry with timeout and durable checkpoint safeguards."
-            }
-            Self::Approval => {
-                "Adds explicit approval orchestration with signal resolution and compensation fallback."
-            }
-            Self::RetrySaga => {
-                "Builds retry-oriented saga safety with timeout, checkpointing, and compensation paths."
-            }
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn extension_keys(self) -> &'static [ExtensionKey] {
         match self {
             Self::Webhook => &[
                 ExtensionKey::AddTimeoutGuard,
                 ExtensionKey::AddDurableCheckpoint,

*** result: Success
