*** src/flow_extender/mod.rs:704:6: delete ! in plan_missing_entry

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete ! in plan_missing_entry
@@ -696,17 +696,17 @@
                 invariants: vec!["Signal wait path keeps deterministic node ordering.".to_string()],
             },
             plan: plan_missing_signal_resolution,
         },
     ]
 }
 
 fn plan_missing_entry(workflow: &Workflow) -> Option<RulePlan> {
-    (!workflow
+    ( /* ~ changed by cargo-mutants ~ */workflow
         .nodes
         .iter()
         .any(|node| node.category == NodeCategory::Entry))
     .then(|| RulePlan {
         rationale:
             "Workflow has no entry node. Add an HTTP trigger so execution has a clear start."
                 .to_string(),
         patch: PatchPlan {

---- flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added stdout ----

thread 'flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added' (1795343) panicked at src/flow_extender/mod.rs:1527:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::HttpHandler(_)))

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1795348) panicked at src/flow_extender/mod.rs:1849:9:
assertion failed: plan.steps.len() >= 3

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1795357) panicked at src/flow_extender/mod.rs:1898:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::HttpHandler(_)))

failures:
    flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added
    flow_extender::tests::given_empty_workflow_when_suggesting_then_entry_trigger_is_recommended
    flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 453 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
