*** src/flow_extender/mod.rs:707:35: replace == with != in plan_missing_entry

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace == with != in plan_missing_entry
@@ -699,17 +699,17 @@
         },
     ]
 }
 
 fn plan_missing_entry(workflow: &Workflow) -> Option<RulePlan> {
     (!workflow
         .nodes
         .iter()
-        .any(|node| node.category == NodeCategory::Entry))
+        .any(|node| node.category != /* ~ changed by cargo-mutants ~ */ NodeCategory::Entry))
     .then(|| RulePlan {
         rationale:
             "Workflow has no entry node. Add an HTTP trigger so execution has a clear start."
                 .to_string(),
         patch: PatchPlan {
             nodes: vec![PatchNode {
                 node_type: "http-handler",
                 x: 120.0,

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1802791) panicked at src/flow_extender/mod.rs:1849:9:
assertion failed: plan.steps.len() >= 3

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1802800) panicked at src/flow_extender/mod.rs:1898:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::HttpHandler(_)))

failures:
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
