*** src/flow_extender/mod.rs:724:5: replace plan_missing_timeout_guard -> Option<RulePlan> with None

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace plan_missing_timeout_guard -> Option<RulePlan> with None
@@ -716,44 +716,17 @@
                 y: 100.0,
             }],
             connections: Vec::new(),
         },
     })
 }
 
 fn plan_missing_timeout_guard(workflow: &Workflow) -> Option<RulePlan> {
-    let has_durable = workflow
-        .nodes
-        .iter()
-        .any(|node| node.category == NodeCategory::Durable);
-    let has_timeout = workflow
-        .nodes
-        .iter()
-        .any(|node| matches!(node.node, WorkflowNode::Timeout(_)));
-    let anchor = first_node_by_type(workflow, |node| node.category == NodeCategory::Durable)?;
-
-    (has_durable && !has_timeout).then(|| RulePlan {
-        rationale:
-            "Durable calls are present without timeout nodes. Add a timeout guard for safer execution."
-                .to_string(),
-        patch: PatchPlan {
-            nodes: vec![PatchNode {
-                node_type: "timeout",
-                x: anchor.x + 220.0,
-                y: anchor.y,
-            }],
-            connections: vec![PatchConnection {
-                source: PatchEndpoint::Existing(anchor.id),
-                target: PatchEndpoint::Proposed(0),
-                source_port: "out",
-                target_port: "in",
-            }],
-        },
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn plan_reliability_bundle(workflow: &Workflow) -> Option<RulePlan> {
     if !workflow.nodes.iter().any(is_side_effecting_durable) {
         return None;
     }
 
     let timeout = plan_missing_timeout_guard(workflow).map(|plan| ("timeout", plan));

---- flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge stdout ----

thread 'flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge' (1802333) panicked at src/flow_extender/mod.rs:1557:9:
assertion failed: preview.is_some()

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1802335) panicked at src/flow_extender/mod.rs:1875:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::Timeout(_)))

---- flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent stdout ----

thread 'flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent' (1802332) panicked at src/flow_extender/mod.rs:1662:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent
    flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 455 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
