*** src/flow_extender/mod.rs:732:68: replace == with != in plan_missing_timeout_guard

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace == with != in plan_missing_timeout_guard
@@ -724,17 +724,17 @@
     let has_durable = workflow
         .nodes
         .iter()
         .any(|node| node.category == NodeCategory::Durable);
     let has_timeout = workflow
         .nodes
         .iter()
         .any(|node| matches!(node.node, WorkflowNode::Timeout(_)));
-    let anchor = first_node_by_type(workflow, |node| node.category == NodeCategory::Durable)?;
+    let anchor = first_node_by_type(workflow, |node| node.category != /* ~ changed by cargo-mutants ~ */ NodeCategory::Durable)?;
 
     (has_durable && !has_timeout).then(|| RulePlan {
         rationale:
             "Durable calls are present without timeout nodes. Add a timeout guard for safer execution."
                 .to_string(),
         patch: PatchPlan {
             nodes: vec![PatchNode {
                 node_type: "timeout",

---- flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent stdout ----

thread 'flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent' (1810178) panicked at src/flow_extender/mod.rs:1689:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge stdout ----

thread 'flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge' (1810179) panicked at src/flow_extender/mod.rs:1584:9:
assertion failed: preview.is_some()

failures:
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent
    flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
