*** src/flow_extender/mod.rs:734:18: replace && with || in plan_missing_timeout_guard

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace && with || in plan_missing_timeout_guard
@@ -726,17 +726,17 @@
         .iter()
         .any(|node| node.category == NodeCategory::Durable);
     let has_timeout = workflow
         .nodes
         .iter()
         .any(|node| matches!(node.node, WorkflowNode::Timeout(_)));
     let anchor = first_node_by_type(workflow, |node| node.category == NodeCategory::Durable)?;
 
-    (has_durable && !has_timeout).then(|| RulePlan {
+    (has_durable || /* ~ changed by cargo-mutants ~ */ !has_timeout).then(|| RulePlan {
         rationale:
             "Durable calls are present without timeout nodes. Add a timeout guard for safer execution."
                 .to_string(),
         patch: PatchPlan {
             nodes: vec![PatchNode {
                 node_type: "timeout",
                 x: anchor.x + 220.0,
                 y: anchor.y,

*** result: Success
