*** src/flow_extender/mod.rs:734:21: delete ! in plan_missing_timeout_guard

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete ! in plan_missing_timeout_guard
@@ -726,17 +726,17 @@
         .iter()
         .any(|node| node.category == NodeCategory::Durable);
     let has_timeout = workflow
         .nodes
         .iter()
         .any(|node| matches!(node.node, WorkflowNode::Timeout(_)));
     let anchor = first_node_by_type(workflow, |node| node.category == NodeCategory::Durable)?;
 
-    (has_durable && !has_timeout).then(|| RulePlan {
+    (has_durable &&  /* ~ changed by cargo-mutants ~ */has_timeout).then(|| RulePlan {
         rationale:
             "Durable calls are present without timeout nodes. Add a timeout guard for safer execution."
                 .to_string(),
         patch: PatchPlan {
             nodes: vec![PatchNode {
                 node_type: "timeout",
                 x: anchor.x + 220.0,
                 y: anchor.y,

---- flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent stdout ----

thread 'flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent' (1815075) panicked at src/flow_extender/mod.rs:1689:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge stdout ----

thread 'flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge' (1815076) panicked at src/flow_extender/mod.rs:1584:9:
assertion failed: preview.is_some()

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1815078) panicked at src/flow_extender/mod.rs:1902:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::Timeout(_)))

failures:
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent
    flow_extender::tests::given_timeout_guard_preview_when_rule_applies_then_patch_contains_proposed_node_and_edge
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 455 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
