*** src/flow_extender/mod.rs:755:5: replace plan_reliability_bundle -> Option<RulePlan> with None

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace plan_reliability_bundle -> Option<RulePlan> with None
@@ -747,53 +747,17 @@
                 source_port: "out",
                 target_port: "in",
             }],
         },
     })
 }
 
 fn plan_reliability_bundle(workflow: &Workflow) -> Option<RulePlan> {
-    if !workflow.nodes.iter().any(is_side_effecting_durable) {
-        return None;
-    }
-
-    let timeout = plan_missing_timeout_guard(workflow).map(|plan| ("timeout", plan));
-    let checkpoint = key_is_compatible_with_workflow(workflow, ExtensionKey::AddDurableCheckpoint)
-        .then(|| plan_missing_checkpoint(workflow))
-        .flatten()
-        .map(|plan| ("checkpoint", plan));
-    let compensation = plan_unbalanced_condition(workflow).map(|plan| ("compensation", plan));
-
-    let parts = [timeout, checkpoint, compensation]
-        .into_iter()
-        .flatten()
-        .collect::<Vec<_>>();
-    if parts.is_empty() {
-        return None;
-    }
-
-    let mut patch = PatchPlan {
-        nodes: Vec::new(),
-        connections: Vec::new(),
-    };
-    let mut labels = Vec::new();
-
-    for (label, plan) in parts {
-        labels.push(label);
-        append_patch_plan(&mut patch, &plan.patch);
-    }
-
-    Some(RulePlan {
-        rationale: format!(
-            "Side-effecting ctx.run semantics are present. Recommend reliability bundle covering {}.",
-            labels.join(", ")
-        ),
-        patch,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn plan_missing_checkpoint(workflow: &Workflow) -> Option<RulePlan> {
     let has_durable = workflow
         .nodes
         .iter()
         .any(|node| node.category == NodeCategory::Durable);
     let has_state_write = workflow

---- flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported stdout ----

thread 'flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported' (1827517) panicked at src/flow_extender/mod.rs:1631:9:
assertion failed: bundle.is_some()

---- flow_extender::tests::given_service_context_when_analyzing_then_workflow_only_recommendations_are_not_emitted stdout ----

thread 'flow_extender::tests::given_service_context_when_analyzing_then_workflow_only_recommendations_are_not_emitted' (1827529) panicked at src/flow_extender/mod.rs:1758:9:
assertion failed: analyses.iter().all(|item| item.key != "add-compensation-branch")

---- flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints stdout ----

thread 'flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints' (1827531) panicked at src/flow_extender/mod.rs:1602:9:
assertion failed: keys.contains(&"add-reliability-bundle")

failures:
    flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported
    flow_extender::tests::given_service_context_when_analyzing_then_workflow_only_recommendations_are_not_emitted
    flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints

test result: FAILED. 455 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
