*** src/flow_extender/mod.rs:755:8: delete ! in plan_reliability_bundle

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete ! in plan_reliability_bundle
@@ -747,17 +747,17 @@
                 source_port: "out",
                 target_port: "in",
             }],
         },
     })
 }
 
 fn plan_reliability_bundle(workflow: &Workflow) -> Option<RulePlan> {
-    if !workflow.nodes.iter().any(is_side_effecting_durable) {
+    if  /* ~ changed by cargo-mutants ~ */workflow.nodes.iter().any(is_side_effecting_durable) {
         return None;
     }
 
     let timeout = plan_missing_timeout_guard(workflow).map(|plan| ("timeout", plan));
     let checkpoint = key_is_compatible_with_workflow(workflow, ExtensionKey::AddDurableCheckpoint)
         .then(|| plan_missing_checkpoint(workflow))
         .flatten()
         .map(|plan| ("checkpoint", plan));

---- flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported stdout ----

thread 'flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported' (1827035) panicked at src/flow_extender/mod.rs:1667:9:
assertion failed: bundle.is_some()

---- flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints stdout ----

thread 'flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints' (1827049) panicked at src/flow_extender/mod.rs:1638:9:
assertion failed: keys.contains(&"add-reliability-bundle")

---- flow_extender::tests::given_service_context_when_analyzing_then_workflow_only_recommendations_are_not_emitted stdout ----

thread 'flow_extender::tests::given_service_context_when_analyzing_then_workflow_only_recommendations_are_not_emitted' (1827047) panicked at src/flow_extender/mod.rs:1794:9:
assertion failed: analyses.iter().all(|item| item.key != "add-compensation-branch")

failures:
    flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported
    flow_extender::tests::given_service_context_when_analyzing_then_workflow_only_recommendations_are_not_emitted
    flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints
    flow_extender::tests::given_workflow_without_side_effecting_durable_when_suggesting_then_bundle_is_absent

test result: FAILED. 454 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
