*** src/flow_extender/mod.rs:795:5: replace plan_missing_checkpoint -> Option<RulePlan> with None

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace plan_missing_checkpoint -> Option<RulePlan> with None
@@ -787,44 +787,17 @@
             "Side-effecting ctx.run semantics are present. Recommend reliability bundle covering {}.",
             labels.join(", ")
         ),
         patch,
     })
 }
 
 fn plan_missing_checkpoint(workflow: &Workflow) -> Option<RulePlan> {
-    let has_durable = workflow
-        .nodes
-        .iter()
-        .any(|node| node.category == NodeCategory::Durable);
-    let has_state_write = workflow
-        .nodes
-        .iter()
-        .any(|node| matches!(node.node, WorkflowNode::SetState(_)));
-    let anchor = first_node_by_type(workflow, |node| node.category == NodeCategory::Durable)?;
-
-    (has_durable && !has_state_write).then(|| RulePlan {
-        rationale:
-            "No state write step found after durable actions. Add a checkpoint to persist progress."
-                .to_string(),
-        patch: PatchPlan {
-            nodes: vec![PatchNode {
-                node_type: "set-state",
-                x: anchor.x + 220.0,
-                y: anchor.y + 80.0,
-            }],
-            connections: vec![PatchConnection {
-                source: PatchEndpoint::Existing(anchor.id),
-                target: PatchEndpoint::Proposed(0),
-                source_port: "out",
-                target_port: "in",
-            }],
-        },
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn plan_unbalanced_condition(workflow: &Workflow) -> Option<RulePlan> {
     let condition_node = workflow
         .nodes
         .iter()
         .find(|node| {
             matches!(node.node, WorkflowNode::Condition(_))

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1828158) panicked at src/flow_extender/mod.rs:1879:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::SetState(_)))

failures:
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 457 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
