*** src/flow_extender/mod.rs:803:68: replace == with != in plan_missing_checkpoint

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace == with != in plan_missing_checkpoint
@@ -795,17 +795,17 @@
     let has_durable = workflow
         .nodes
         .iter()
         .any(|node| node.category == NodeCategory::Durable);
     let has_state_write = workflow
         .nodes
         .iter()
         .any(|node| matches!(node.node, WorkflowNode::SetState(_)));
-    let anchor = first_node_by_type(workflow, |node| node.category == NodeCategory::Durable)?;
+    let anchor = first_node_by_type(workflow, |node| node.category != /* ~ changed by cargo-mutants ~ */ NodeCategory::Durable)?;
 
     (has_durable && !has_state_write).then(|| RulePlan {
         rationale:
             "No state write step found after durable actions. Add a checkpoint to persist progress."
                 .to_string(),
         patch: PatchPlan {
             nodes: vec![PatchNode {
                 node_type: "set-state",

---- durable_checkpoint_contract stdout ----

thread 'durable_checkpoint_contract' (1843694) panicked at tests/flow_extender_contracts.rs:142:5:
assertion failed: workflow.connections.iter().any(|connection|
        connection.source == durable_id && connection.target_port.0 == "in")

failures:
    durable_checkpoint_contract

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
