*** src/flow_extender/mod.rs:805:21: delete ! in plan_missing_checkpoint

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete ! in plan_missing_checkpoint
@@ -797,17 +797,17 @@
         .iter()
         .any(|node| node.category == NodeCategory::Durable);
     let has_state_write = workflow
         .nodes
         .iter()
         .any(|node| matches!(node.node, WorkflowNode::SetState(_)));
     let anchor = first_node_by_type(workflow, |node| node.category == NodeCategory::Durable)?;
 
-    (has_durable && !has_state_write).then(|| RulePlan {
+    (has_durable &&  /* ~ changed by cargo-mutants ~ */has_state_write).then(|| RulePlan {
         rationale:
             "No state write step found after durable actions. Add a checkpoint to persist progress."
                 .to_string(),
         patch: PatchPlan {
             nodes: vec![PatchNode {
                 node_type: "set-state",
                 x: anchor.x + 220.0,
                 y: anchor.y + 80.0,

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1843893) panicked at src/flow_extender/mod.rs:1906:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::SetState(_)))

failures:
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 457 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
