*** src/flow_extender/mod.rs:831:17: replace && with || in plan_unbalanced_condition

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace && with || in plan_unbalanced_condition
@@ -823,17 +823,17 @@
 }
 
 fn plan_unbalanced_condition(workflow: &Workflow) -> Option<RulePlan> {
     let condition_node = workflow
         .nodes
         .iter()
         .find(|node| {
             matches!(node.node, WorkflowNode::Condition(_))
-                && missing_condition_branch(workflow, node.id)
+                || /* ~ changed by cargo-mutants ~ */ missing_condition_branch(workflow, node.id)
         })
         .cloned()?;
 
     Some(RulePlan {
         rationale:
             "At least one condition node is missing a true/false branch. Add compensation logic for failure paths.".to_string(),
         patch: PatchPlan {
             nodes: vec![PatchNode {

---- compensation_branch_contract stdout ----

thread 'compensation_branch_contract' (1857472) panicked at tests/flow_extender_contracts.rs:179:5:
assertion failed: workflow.connections.iter().any(|connection|
        {
            connection.source == condition_id &&
                    connection.target == compensate_node_id &&
                connection.source_port.0 == "false"
        })

failures:
    compensation_branch_contract

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
