*** src/flow_extender/mod.rs:855:5: replace plan_missing_signal_resolution -> Option<RulePlan> with None

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace plan_missing_signal_resolution -> Option<RulePlan> with None
@@ -847,40 +847,17 @@
                 source_port: "false",
                 target_port: "in",
             }],
         },
     })
 }
 
 fn plan_missing_signal_resolution(workflow: &Workflow) -> Option<RulePlan> {
-    let has_resolver = workflow
-        .nodes
-        .iter()
-        .any(|node| matches!(node.node, WorkflowNode::ResolvePromise(_)));
-
-    let wait_node = first_node_by_type(workflow, |node| is_signal_wait_anchor(workflow, node))?;
-
-    (!has_resolver).then(|| RulePlan {
-        rationale:
-            "Workflow waits on external events but has no resolve step. Add resolve-promise to close the loop.".to_string(),
-        patch: PatchPlan {
-            nodes: vec![PatchNode {
-                node_type: "resolve-promise",
-                x: wait_node.x + 220.0,
-                y: wait_node.y,
-            }],
-            connections: vec![PatchConnection {
-                source: PatchEndpoint::Existing(wait_node.id),
-                target: PatchEndpoint::Proposed(0),
-                source_port: "out",
-                target_port: "in",
-            }],
-        },
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn execute_patch(
     workflow: &mut Workflow,
     key: ExtensionKey,
     fingerprint: &str,
     patch: &PatchPlan,
 ) -> Vec<NodeId> {

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1859505) panicked at src/flow_extender/mod.rs:1826:9:
assertion failed: plan.steps.len() >= 3

failures:
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order

test result: FAILED. 457 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
