*** src/flow_extender/mod.rs:862:6: delete ! in plan_missing_signal_resolution

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete ! in plan_missing_signal_resolution
@@ -854,17 +854,17 @@
 fn plan_missing_signal_resolution(workflow: &Workflow) -> Option<RulePlan> {
     let has_resolver = workflow
         .nodes
         .iter()
         .any(|node| matches!(node.node, WorkflowNode::ResolvePromise(_)));
 
     let wait_node = first_node_by_type(workflow, |node| is_signal_wait_anchor(workflow, node))?;
 
-    (!has_resolver).then(|| RulePlan {
+    ( /* ~ changed by cargo-mutants ~ */has_resolver).then(|| RulePlan {
         rationale:
             "Workflow waits on external events but has no resolve step. Add resolve-promise to close the loop.".to_string(),
         patch: PatchPlan {
             nodes: vec![PatchNode {
                 node_type: "resolve-promise",
                 x: wait_node.x + 220.0,
                 y: wait_node.y,
             }],

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1863480) panicked at src/flow_extender/mod.rs:1849:9:
assertion failed: plan.steps.len() >= 3

failures:
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order

test result: FAILED. 457 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
