*** src/flow_extender/mod.rs:887:5: replace execute_patch -> Vec<NodeId> with vec![]

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace execute_patch -> Vec<NodeId> with vec![]
@@ -879,38 +879,17 @@
 }
 
 fn execute_patch(
     workflow: &mut Workflow,
     key: ExtensionKey,
     fingerprint: &str,
     patch: &PatchPlan,
 ) -> Vec<NodeId> {
-    let created_nodes = patch
-        .nodes
-        .iter()
-        .map(|node| workflow.add_node(node.node_type, node.x, node.y))
-        .collect::<Vec<_>>();
-
-    annotate_extension_nodes(workflow, key, fingerprint, &created_nodes);
-
-    patch.connections.iter().for_each(|connection| {
-        let source = resolve_patch_endpoint(connection.source, &created_nodes);
-        let target = resolve_patch_endpoint(connection.target, &created_nodes);
-        if let (Some(source_id), Some(target_id)) = (source, target) {
-            let _ = workflow.add_connection(
-                source_id,
-                target_id,
-                &PortName::from(connection.source_port),
-                &PortName::from(connection.target_port),
-            );
-        }
-    });
-
-    created_nodes
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_reliability_bundle(
     workflow: &mut Workflow,
     key: &str,
 ) -> Result<AppliedExtension, String> {
     let mut created_nodes = Vec::new();
     for part in reliability_bundle_members() {

---- flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added stdout ----

thread 'flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added' (1871502) panicked at src/flow_extender/mod.rs:1506:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::HttpHandler(_)))

---- flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent stdout ----

thread 'flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent' (1871513) panicked at src/flow_extender/mod.rs:1668:9:
assertion `left == right` failed
  left: 0
 right: 1

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1871516) panicked at src/flow_extender/mod.rs:1877:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::HttpHandler(_)))

failures:
    flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent
    flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 454 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
