*** src/flow_extender/mod.rs:92:13: delete match arm "webhook" in <impl FromStr for ExtensionPresetKey>::from_str

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete match arm "webhook" in <impl FromStr for ExtensionPresetKey>::from_str
@@ -84,17 +84,17 @@
     }
 }
 
 impl FromStr for ExtensionPresetKey {
     type Err = String;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         match value {
-            "webhook" => Ok(Self::Webhook),
+             /* ~ changed by cargo-mutants ~ */
             "approval" => Ok(Self::Approval),
             "retry-saga" => Ok(Self::RetrySaga),
             _ => Err(format!("Unknown extension preset key: {value}")),
         }
     }
 }
 
 impl ExtensionKey {

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1699332) panicked at src/flow_extender/mod.rs:1887:9:
assertion failed: resolved.is_ok()

failures:
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 457 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
