*** src/flow_extender/mod.rs:937:44: replace == with != in annotate_extension_nodes

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace == with != in annotate_extension_nodes
@@ -929,17 +929,17 @@
     key: ExtensionKey,
     fingerprint: &str,
     node_ids: &[NodeId],
 ) {
     for node_id in node_ids {
         if let Some(node) = workflow
             .nodes
             .iter_mut()
-            .find(|candidate| candidate.id == *node_id)
+            .find(|candidate| candidate.id != /* ~ changed by cargo-mutants ~ */ *node_id)
         {
             let mut metadata = serde_json::Map::new();
             metadata.insert(
                 "extension_key".to_string(),
                 serde_json::Value::String(key.as_str().to_string()),
             );
             metadata.insert(
                 "fingerprint".to_string(),

---- flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent stdout ----

thread 'flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent' (1874357) panicked at src/flow_extender/mod.rs:1715:9:
assertion failed: fingerprint.is_some()

failures:
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent

test result: FAILED. 457 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
