*** src/flow_extender/mod.rs:93:13: delete match arm "approval" in <impl FromStr for ExtensionPresetKey>::from_str

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete match arm "approval" in <impl FromStr for ExtensionPresetKey>::from_str
@@ -85,17 +85,17 @@
 }
 
 impl FromStr for ExtensionPresetKey {
     type Err = String;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         match value {
             "webhook" => Ok(Self::Webhook),
-            "approval" => Ok(Self::Approval),
+             /* ~ changed by cargo-mutants ~ */
             "retry-saga" => Ok(Self::RetrySaga),
             _ => Err(format!("Unknown extension preset key: {value}")),
         }
     }
 }
 
 impl ExtensionKey {
     #[must_use]

*** result: Success
