*** src/flow_extender/mod.rs:94:13: delete match arm "retry-saga" in <impl FromStr for ExtensionPresetKey>::from_str

*** mutation diff:
--- src/flow_extender/mod.rs
+++ delete match arm "retry-saga" in <impl FromStr for ExtensionPresetKey>::from_str
@@ -86,17 +86,17 @@
 
 impl FromStr for ExtensionPresetKey {
     type Err = String;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         match value {
             "webhook" => Ok(Self::Webhook),
             "approval" => Ok(Self::Approval),
-            "retry-saga" => Ok(Self::RetrySaga),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(format!("Unknown extension preset key: {value}")),
         }
     }
 }
 
 impl ExtensionKey {
     #[must_use]
     pub const fn as_str(self) -> &'static str {

---- flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order stdout ----

thread 'flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order' (1700687) panicked at src/flow_extender/mod.rs:1863:9:
assertion failed: resolved.is_ok()

failures:
    flow_extender::tests::given_retry_saga_preset_when_resolving_then_dependencies_expand_in_order

test result: FAILED. 457 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
