*** src/flow_extender/mod.rs:958:5: replace has_extension_fingerprint -> bool with true

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace has_extension_fingerprint -> bool with true
@@ -950,25 +950,17 @@
                 serde_json::to_value(extension_semantics(key)).unwrap_or(serde_json::Value::Null),
             );
             node.metadata = serde_json::json!({ "flow_extender": metadata });
         }
     }
 }
 
 fn has_extension_fingerprint(workflow: &Workflow, fingerprint: &str) -> bool {
-    workflow.nodes.iter().any(|node| {
-        node.metadata
-            .as_object()
-            .and_then(|meta| meta.get("flow_extender"))
-            .and_then(serde_json::Value::as_object)
-            .and_then(|ext| ext.get("fingerprint"))
-            .and_then(serde_json::Value::as_str)
-            .is_some_and(|value| value == fingerprint)
-    })
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn append_patch_plan(target: &mut PatchPlan, patch: &PatchPlan) {
     let offset = target.nodes.len();
     target.nodes.extend(patch.nodes.iter().cloned());
 
     target
         .connections

---- flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added stdout ----

thread 'flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added' (1887746) panicked at src/flow_extender/mod.rs:1519:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::HttpHandler(_)))

---- flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent stdout ----

thread 'flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent' (1887743) panicked at src/flow_extender/mod.rs:1724:9:
assertion failed: !initial.created_nodes.is_empty()

---- flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent stdout ----

thread 'flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent' (1887757) panicked at src/flow_extender/mod.rs:1681:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    flow_extender::tests::given_bundle_when_applying_twice_then_second_apply_is_idempotent
    flow_extender::tests::given_empty_workflow_when_applying_entry_trigger_then_http_handler_is_added
    flow_extender::tests::given_stamped_fingerprint_when_applying_then_extension_is_idempotent
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 454 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
