*** src/flow_extender/mod.rs:958:5: replace has_extension_fingerprint -> bool with false

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace has_extension_fingerprint -> bool with false
@@ -950,25 +950,17 @@
                 serde_json::to_value(extension_semantics(key)).unwrap_or(serde_json::Value::Null),
             );
             node.metadata = serde_json::json!({ "flow_extender": metadata });
         }
     }
 }
 
 fn has_extension_fingerprint(workflow: &Workflow, fingerprint: &str) -> bool {
-    workflow.nodes.iter().any(|node| {
-        node.metadata
-            .as_object()
-            .and_then(|meta| meta.get("flow_extender"))
-            .and_then(serde_json::Value::as_object)
-            .and_then(|ext| ext.get("fingerprint"))
-            .and_then(serde_json::Value::as_str)
-            .is_some_and(|value| value == fingerprint)
-    })
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn append_patch_plan(target: &mut PatchPlan, patch: &PatchPlan) {
     let offset = target.nodes.len();
     target.nodes.extend(patch.nodes.iter().cloned());
 
     target
         .connections

*** result: Success
