*** src/flow_extender/mod.rs:965:40: replace == with != in has_extension_fingerprint

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace == with != in has_extension_fingerprint
@@ -957,17 +957,17 @@
 fn has_extension_fingerprint(workflow: &Workflow, fingerprint: &str) -> bool {
     workflow.nodes.iter().any(|node| {
         node.metadata
             .as_object()
             .and_then(|meta| meta.get("flow_extender"))
             .and_then(serde_json::Value::as_object)
             .and_then(|ext| ext.get("fingerprint"))
             .and_then(serde_json::Value::as_str)
-            .is_some_and(|value| value == fingerprint)
+            .is_some_and(|value| value != /* ~ changed by cargo-mutants ~ */ fingerprint)
     })
 }
 
 fn append_patch_plan(target: &mut PatchPlan, patch: &PatchPlan) {
     let offset = target.nodes.len();
     target.nodes.extend(patch.nodes.iter().cloned());
 
     target

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1888228) panicked at src/flow_extender/mod.rs:1902:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::Timeout(_)))

failures:
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 457 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
