*** src/flow_extender/mod.rs:970:5: replace append_patch_plan with ()

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace append_patch_plan with ()
@@ -962,27 +962,17 @@
             .and_then(serde_json::Value::as_object)
             .and_then(|ext| ext.get("fingerprint"))
             .and_then(serde_json::Value::as_str)
             .is_some_and(|value| value == fingerprint)
     })
 }
 
 fn append_patch_plan(target: &mut PatchPlan, patch: &PatchPlan) {
-    let offset = target.nodes.len();
-    target.nodes.extend(patch.nodes.iter().cloned());
-
-    target
-        .connections
-        .extend(patch.connections.iter().map(|connection| PatchConnection {
-            source: remap_endpoint(connection.source, offset),
-            target: remap_endpoint(connection.target, offset),
-            source_port: connection.source_port,
-            target_port: connection.target_port,
-        }));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 const fn remap_endpoint(endpoint: PatchEndpoint, offset: usize) -> PatchEndpoint {
     match endpoint {
         PatchEndpoint::Existing(node_id) => PatchEndpoint::Existing(node_id),
         PatchEndpoint::Proposed(index) => PatchEndpoint::Proposed(index + offset),
     }
 }

---- reliability_bundle_preview_apply_contract_match_in_service_context stdout ----

thread 'reliability_bundle_preview_apply_contract_match_in_service_context' (1897065) panicked at tests/flow_extender_contracts.rs:271:5:
assertion `left == right` failed
  left: ["timeout"]
 right: []

failures:
    reliability_bundle_preview_apply_contract_match_in_service_context

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
