*** src/flow_extender/mod.rs:986:73: replace + with - in remap_endpoint

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace + with - in remap_endpoint
@@ -978,17 +978,17 @@
             source_port: connection.source_port,
             target_port: connection.target_port,
         }));
 }
 
 const fn remap_endpoint(endpoint: PatchEndpoint, offset: usize) -> PatchEndpoint {
     match endpoint {
         PatchEndpoint::Existing(node_id) => PatchEndpoint::Existing(node_id),
-        PatchEndpoint::Proposed(index) => PatchEndpoint::Proposed(index + offset),
+        PatchEndpoint::Proposed(index) => PatchEndpoint::Proposed(index - /* ~ changed by cargo-mutants ~ */ offset),
     }
 }
 
 fn extension_fingerprint(key: ExtensionKey, patch: &PatchPlan) -> String {
     let node_parts = patch
         .nodes
         .iter()
         .map(|node| format!("{}@{:.2}:{:.2}", node.node_type, node.x, node.y))

---- flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported stdout ----

thread 'flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported' (1900526) panicked at src/flow_extender/mod.rs:986:67:
attempt to subtract with overflow

---- flow_extender::tests::given_service_context_when_analyzing_then_workflow_only_recommendations_are_not_emitted stdout ----

thread 'flow_extender::tests::given_service_context_when_analyzing_then_workflow_only_recommendations_are_not_emitted' (1900538) panicked at src/flow_extender/mod.rs:986:67:
attempt to subtract with overflow

---- flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints stdout ----

thread 'flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints' (1900540) panicked at src/flow_extender/mod.rs:986:67:
attempt to subtract with overflow

failures:
    flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_service_context_when_analyzing_then_workflow_only_recommendations_are_not_emitted
    flow_extender::tests::given_side_effecting_durable_when_suggesting_then_bundle_replaces_isolated_hints

test result: FAILED. 454 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
