*** src/flow_extender/mod.rs:991:5: replace extension_fingerprint -> String with String::new()

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace extension_fingerprint -> String with String::new()
@@ -983,37 +983,17 @@
 const fn remap_endpoint(endpoint: PatchEndpoint, offset: usize) -> PatchEndpoint {
     match endpoint {
         PatchEndpoint::Existing(node_id) => PatchEndpoint::Existing(node_id),
         PatchEndpoint::Proposed(index) => PatchEndpoint::Proposed(index + offset),
     }
 }
 
 fn extension_fingerprint(key: ExtensionKey, patch: &PatchPlan) -> String {
-    let node_parts = patch
-        .nodes
-        .iter()
-        .map(|node| format!("{}@{:.2}:{:.2}", node.node_type, node.x, node.y))
-        .collect::<Vec<_>>()
-        .join("|");
-    let connection_parts = patch
-        .connections
-        .iter()
-        .map(|connection| {
-            format!(
-                "{}>{}:{}->{}",
-                endpoint_signature(connection.source),
-                endpoint_signature(connection.target),
-                connection.source_port,
-                connection.target_port
-            )
-        })
-        .collect::<Vec<_>>()
-        .join("|");
-    format!("{}::{node_parts}::{connection_parts}", key.as_str())
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn endpoint_signature(endpoint: PatchEndpoint) -> String {
     match endpoint {
         PatchEndpoint::Existing(node_id) => format!("e:{node_id}"),
         PatchEndpoint::Proposed(index) => format!("p:{index}"),
     }
 }

---- flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic stdout ----

thread 'flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic' (1912509) panicked at src/flow_extender/mod.rs:1593:9:
assertion failed: !entry.fingerprint.is_empty()

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1912519) panicked at src/flow_extender/mod.rs:1882:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::Timeout(_)))

---- flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported stdout ----

thread 'flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported' (1912501) panicked at src/flow_extender/mod.rs:1654:9:
assertion failed: !bundle.fingerprint.is_empty()

failures:
    flow_extender::tests::given_bundle_when_analyzing_then_confidence_and_rationale_are_reported
    flow_extender::tests::given_missing_entry_when_analyzing_then_confidence_and_rationale_class_are_deterministic
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 454 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
