*** src/flow_extender/mod.rs:991:5: replace extension_fingerprint -> String with "xyzzy".into()

*** mutation diff:
--- src/flow_extender/mod.rs
+++ replace extension_fingerprint -> String with "xyzzy".into()
@@ -983,37 +983,17 @@
 const fn remap_endpoint(endpoint: PatchEndpoint, offset: usize) -> PatchEndpoint {
     match endpoint {
         PatchEndpoint::Existing(node_id) => PatchEndpoint::Existing(node_id),
         PatchEndpoint::Proposed(index) => PatchEndpoint::Proposed(index + offset),
     }
 }
 
 fn extension_fingerprint(key: ExtensionKey, patch: &PatchPlan) -> String {
-    let node_parts = patch
-        .nodes
-        .iter()
-        .map(|node| format!("{}@{:.2}:{:.2}", node.node_type, node.x, node.y))
-        .collect::<Vec<_>>()
-        .join("|");
-    let connection_parts = patch
-        .connections
-        .iter()
-        .map(|connection| {
-            format!(
-                "{}>{}:{}->{}",
-                endpoint_signature(connection.source),
-                endpoint_signature(connection.target),
-                connection.source_port,
-                connection.target_port
-            )
-        })
-        .collect::<Vec<_>>()
-        .join("|");
-    format!("{}::{node_parts}::{connection_parts}", key.as_str())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn endpoint_signature(endpoint: PatchEndpoint) -> String {
     match endpoint {
         PatchEndpoint::Existing(node_id) => format!("e:{node_id}"),
         PatchEndpoint::Proposed(index) => format!("p:{index}"),
     }
 }

---- flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order stdout ----

thread 'flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order' (1913372) panicked at src/flow_extender/mod.rs:1834:9:
assertion failed: plan.conflicts.is_empty()

---- flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added stdout ----

thread 'flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added' (1913381) panicked at src/flow_extender/mod.rs:1882:9:
assertion failed: workflow.nodes.iter().any(|node|
        matches!(node.node, WorkflowNode::Timeout(_)))

failures:
    flow_extender::tests::given_multi_rule_workflow_when_generating_compound_plan_then_steps_are_built_in_dependency_order
    flow_extender::tests::given_webhook_preset_when_applying_then_guard_and_checkpoint_are_added

test result: FAILED. 456 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
