*** src/main.rs:1294:5: replace parse_key_event -> Option<EditorCommand> with None

*** mutation diff:
--- src/main.rs
+++ replace parse_key_event -> Option<EditorCommand> with None
@@ -1286,34 +1286,17 @@
     pub shift: bool,
     pub alt: bool,
 }
 
 /// Parse a keyboard event into an optional editor command.
 /// Returns `None` for keys that don't map to editor commands or lack required modifiers.
 #[must_use]
 pub fn parse_key_event(key: &str, modifiers: &KeyModifiers) -> Option<EditorCommand> {
-    match key {
-        // Zoom commands - no modifiers required
-        "+" | "=" | "add" => Some(EditorCommand::ZoomIn),
-        "-" | "_" | "subtract" => Some(EditorCommand::ZoomOut),
-        "0" => Some(EditorCommand::FitView),
-
-        // Undo/Redo - require Ctrl/Cmd modifier (security requirement)
-        // Plain 'z'/'y' should NOT mutate history
-        // Note: More specific patterns must come first
-        "y" | "z" if modifiers.ctrl && modifiers.shift => Some(EditorCommand::Redo),
-        "z" if modifiers.ctrl => Some(EditorCommand::Undo),
-        "y" if modifiers.ctrl => Some(EditorCommand::Redo),
-
-        // Auto layout - accessible via toolbar/context
-        "l" if modifiers.ctrl => Some(EditorCommand::AutoLayout),
-
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Canvas dimensions for viewport calculations.
 #[derive(Clone, Copy, Debug)]
 pub struct CanvasDimensions {
     pub width: f32,
     pub height: f32,
 }

---- command_tests::given_ctrl_l_key_when_parsing_then_returns_auto_layout stdout ----

thread 'command_tests::given_ctrl_l_key_when_parsing_then_returns_auto_layout' (1408646) panicked at src/main.rs:1410:9:
assertion `left == right` failed
  left: None
 right: Some(AutoLayout)

---- command_tests::given_ctrl_shift_z_key_when_parsing_then_returns_redo stdout ----

thread 'command_tests::given_ctrl_shift_z_key_when_parsing_then_returns_redo' (1408647) panicked at src/main.rs:1362:9:
assertion `left == right` failed
  left: None
 right: Some(Redo)

---- command_tests::given_ctrl_y_key_when_parsing_then_returns_redo stdout ----

thread 'command_tests::given_ctrl_y_key_when_parsing_then_returns_redo' (1408648) panicked at src/main.rs:1372:9:
assertion `left == right` failed
  left: None
 right: Some(Redo)

failures:
    command_tests::given_ctrl_l_key_when_parsing_then_returns_auto_layout
    command_tests::given_ctrl_shift_z_key_when_parsing_then_returns_redo
    command_tests::given_ctrl_y_key_when_parsing_then_returns_redo
    command_tests::given_ctrl_z_key_when_parsing_then_returns_undo
    command_tests::given_meta_key_as_ctrl_when_parsing_then_interprets_as_ctrl
    command_tests::given_minus_key_when_parsing_then_returns_zoom_out
    command_tests::given_plus_key_when_parsing_then_returns_zoom_in
    command_tests::given_zero_key_when_parsing_then_returns_fit_view

test result: FAILED. 286 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
