*** src/main.rs:1296:9: delete match arm "+" | "=" | "add" in parse_key_event

*** mutation diff:
--- src/main.rs
+++ delete match arm "+" | "=" | "add" in parse_key_event
@@ -1288,17 +1288,17 @@
 }
 
 /// Parse a keyboard event into an optional editor command.
 /// Returns `None` for keys that don't map to editor commands or lack required modifiers.
 #[must_use]
 pub fn parse_key_event(key: &str, modifiers: &KeyModifiers) -> Option<EditorCommand> {
     match key {
         // Zoom commands - no modifiers required
-        "+" | "=" | "add" => Some(EditorCommand::ZoomIn),
+         /* ~ changed by cargo-mutants ~ */
         "-" | "_" | "subtract" => Some(EditorCommand::ZoomOut),
         "0" => Some(EditorCommand::FitView),
 
         // Undo/Redo - require Ctrl/Cmd modifier (security requirement)
         // Plain 'z'/'y' should NOT mutate history
         // Note: More specific patterns must come first
         "y" | "z" if modifiers.ctrl && modifiers.shift => Some(EditorCommand::Redo),
         "z" if modifiers.ctrl => Some(EditorCommand::Undo),

---- command_tests::given_plus_key_when_parsing_then_returns_zoom_in stdout ----

thread 'command_tests::given_plus_key_when_parsing_then_returns_zoom_in' (1410076) panicked at src/main.rs:1403:9:
assertion `left == right` failed
  left: None
 right: Some(ZoomIn)

failures:
    command_tests::given_plus_key_when_parsing_then_returns_zoom_in

test result: FAILED. 293 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
