*** src/main.rs:1297:9: delete match arm "-" | "_" | "subtract" in parse_key_event

*** mutation diff:
--- src/main.rs
+++ delete match arm "-" | "_" | "subtract" in parse_key_event
@@ -1289,17 +1289,17 @@
 
 /// Parse a keyboard event into an optional editor command.
 /// Returns `None` for keys that don't map to editor commands or lack required modifiers.
 #[must_use]
 pub fn parse_key_event(key: &str, modifiers: &KeyModifiers) -> Option<EditorCommand> {
     match key {
         // Zoom commands - no modifiers required
         "+" | "=" | "add" => Some(EditorCommand::ZoomIn),
-        "-" | "_" | "subtract" => Some(EditorCommand::ZoomOut),
+         /* ~ changed by cargo-mutants ~ */
         "0" => Some(EditorCommand::FitView),
 
         // Undo/Redo - require Ctrl/Cmd modifier (security requirement)
         // Plain 'z'/'y' should NOT mutate history
         // Note: More specific patterns must come first
         "y" | "z" if modifiers.ctrl && modifiers.shift => Some(EditorCommand::Redo),
         "z" if modifiers.ctrl => Some(EditorCommand::Undo),
         "y" if modifiers.ctrl => Some(EditorCommand::Redo),

---- command_tests::given_minus_key_when_parsing_then_returns_zoom_out stdout ----

thread 'command_tests::given_minus_key_when_parsing_then_returns_zoom_out' (1411192) panicked at src/main.rs:1410:9:
assertion `left == right` failed
  left: None
 right: Some(ZoomOut)

failures:
    command_tests::given_minus_key_when_parsing_then_returns_zoom_out

test result: FAILED. 293 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
