*** src/main.rs:1298:9: delete match arm "0" in parse_key_event

*** mutation diff:
--- src/main.rs
+++ delete match arm "0" in parse_key_event
@@ -1290,17 +1290,17 @@
 /// Parse a keyboard event into an optional editor command.
 /// Returns `None` for keys that don't map to editor commands or lack required modifiers.
 #[must_use]
 pub fn parse_key_event(key: &str, modifiers: &KeyModifiers) -> Option<EditorCommand> {
     match key {
         // Zoom commands - no modifiers required
         "+" | "=" | "add" => Some(EditorCommand::ZoomIn),
         "-" | "_" | "subtract" => Some(EditorCommand::ZoomOut),
-        "0" => Some(EditorCommand::FitView),
+         /* ~ changed by cargo-mutants ~ */
 
         // Undo/Redo - require Ctrl/Cmd modifier (security requirement)
         // Plain 'z'/'y' should NOT mutate history
         // Note: More specific patterns must come first
         "y" | "z" if modifiers.ctrl && modifiers.shift => Some(EditorCommand::Redo),
         "z" if modifiers.ctrl => Some(EditorCommand::Undo),
         "y" if modifiers.ctrl => Some(EditorCommand::Redo),

---- command_tests::given_zero_key_when_parsing_then_returns_fit_view stdout ----

thread 'command_tests::given_zero_key_when_parsing_then_returns_fit_view' (1412880) panicked at src/main.rs:1417:9:
assertion `left == right` failed
  left: None
 right: Some(FitView)

failures:
    command_tests::given_zero_key_when_parsing_then_returns_fit_view

test result: FAILED. 293 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
