*** src/main.rs:1303:37: replace && with || in parse_key_event

*** mutation diff:
--- src/main.rs
+++ replace && with || in parse_key_event
@@ -1295,17 +1295,17 @@
         // Zoom commands - no modifiers required
         "+" | "=" | "add" => Some(EditorCommand::ZoomIn),
         "-" | "_" | "subtract" => Some(EditorCommand::ZoomOut),
         "0" => Some(EditorCommand::FitView),
 
         // Undo/Redo - require Ctrl/Cmd modifier (security requirement)
         // Plain 'z'/'y' should NOT mutate history
         // Note: More specific patterns must come first
-        "y" | "z" if modifiers.ctrl && modifiers.shift => Some(EditorCommand::Redo),
+        "y" | "z" if modifiers.ctrl || /* ~ changed by cargo-mutants ~ */ modifiers.shift => Some(EditorCommand::Redo),
         "z" if modifiers.ctrl => Some(EditorCommand::Undo),
         "y" if modifiers.ctrl => Some(EditorCommand::Redo),
 
         // Auto layout - accessible via toolbar/context
         "l" if modifiers.ctrl => Some(EditorCommand::AutoLayout),
 
         _ => None,
     }

---- command_tests::given_meta_key_as_ctrl_when_parsing_then_interprets_as_ctrl stdout ----

thread 'command_tests::given_meta_key_as_ctrl_when_parsing_then_interprets_as_ctrl' (1425535) panicked at src/main.rs:1446:9:
assertion `left == right` failed
  left: Some(Redo)
 right: Some(Undo)

---- command_tests::given_ctrl_z_key_when_parsing_then_returns_undo stdout ----

thread 'command_tests::given_ctrl_z_key_when_parsing_then_returns_undo' (1425534) panicked at src/main.rs:1368:9:
assertion `left == right` failed
  left: Some(Redo)
 right: Some(Undo)

failures:
    command_tests::given_ctrl_z_key_when_parsing_then_returns_undo
    command_tests::given_meta_key_as_ctrl_when_parsing_then_interprets_as_ctrl

test result: FAILED. 292 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
