*** src/main.rs:195:13: replace && with || in App

*** mutation diff:
--- src/main.rs
+++ replace && with || in App
@@ -187,17 +187,17 @@
         } else if nodes
             .iter()
             .any(|n| n.execution_state == ExecutionState::Failed)
         {
             ExecutionState::Failed
         } else if nodes
             .iter()
             .all(|n| n.execution_state.is_terminal() || n.execution_state == ExecutionState::Idle)
-            && nodes
+            || /* ~ changed by cargo-mutants ~ */ nodes
                 .iter()
                 .any(|n| n.execution_state == ExecutionState::Completed)
         {
             ExecutionState::Completed
         } else {
             ExecutionState::Idle
         }
     });

*** result: Success
