*** src/main.rs:197:44: replace == with != in App

*** mutation diff:
--- src/main.rs
+++ replace == with != in App
@@ -189,17 +189,17 @@
             .any(|n| n.execution_state == ExecutionState::Failed)
         {
             ExecutionState::Failed
         } else if nodes
             .iter()
             .all(|n| n.execution_state.is_terminal() || n.execution_state == ExecutionState::Idle)
             && nodes
                 .iter()
-                .any(|n| n.execution_state == ExecutionState::Completed)
+                .any(|n| n.execution_state != /* ~ changed by cargo-mutants ~ */ ExecutionState::Completed)
         {
             ExecutionState::Completed
         } else {
             ExecutionState::Idle
         }
     });
     let mut frozen_run_id: Signal<Option<uuid::Uuid>> = use_signal(|| None);
     let is_frozen_mode = use_memo(move || frozen_run_id.read().is_some());

*** result: Success
