*** src/main.rs:32:31: replace || with && in should_end_canvas_interaction

*** mutation diff:
--- src/main.rs
+++ replace || with && in should_end_canvas_interaction
@@ -24,17 +24,17 @@
 
 #[cfg(any(test, target_arch = "wasm32"))]
 const fn should_end_canvas_interaction(
     is_dragging: bool,
     is_panning: bool,
     is_marquee: bool,
     is_connecting: bool,
 ) -> bool {
-    is_dragging || is_panning || is_marquee || is_connecting
+    is_dragging || is_panning && /* ~ changed by cargo-mutants ~ */ is_marquee || is_connecting
 }
 
 #[cfg(target_arch = "wasm32")]
 struct GlobalMouseupListenerInner {
     window: web_sys::Window,
     callback: wasm_bindgen::closure::Closure<dyn FnMut(web_sys::MouseEvent)>,
 }

---- tests::given_active_canvas_mode_when_global_mouseup_fires_then_interaction_ends stdout ----

thread 'tests::given_active_canvas_mode_when_global_mouseup_fires_then_interaction_ends' (1357860) panicked at src/main.rs:1465:9:
assertion failed: should_end

failures:
    tests::given_active_canvas_mode_when_global_mouseup_fires_then_interaction_ends

test result: FAILED. 293 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
