*** src/main.rs:348:50: replace + with * in App

*** mutation diff:
--- src/main.rs
+++ replace + with * in App
@@ -340,17 +340,17 @@
                     .filter_map(move |(edge_idx, edge)| {
                         let source = match &edge.source {
                             PreviewEndpoint::Existing(node_id) => existing_nodes
                                 .get(node_id)
                                 .map(|node| (node.x + 220.0, node.y + 34.0)),
                             PreviewEndpoint::Proposed(temp_id) => proposed_lookup
                                 .get(&format!("p{patch_idx}-{temp_id}"))
                                 .copied()
-                                .map(|(x, y)| (x + 220.0, y + 34.0)),
+                                .map(|(x, y)| (x * /* ~ changed by cargo-mutants ~ */ 220.0, y + 34.0)),
                         };
                         let target = match &edge.target {
                             PreviewEndpoint::Existing(node_id) => existing_nodes
                                 .get(node_id)
                                 .map(|node| (node.x, node.y + 34.0)),
                             PreviewEndpoint::Proposed(temp_id) => proposed_lookup
                                 .get(&format!("p{patch_idx}-{temp_id}"))
                                 .copied()

*** result: Success
