*** src/main.rs:357:53: replace + with - in App

*** mutation diff:
--- src/main.rs
+++ replace + with - in App
@@ -349,17 +349,17 @@
                         };
                         let target = match &edge.target {
                             PreviewEndpoint::Existing(node_id) => existing_nodes
                                 .get(node_id)
                                 .map(|node| (node.x, node.y + 34.0)),
                             PreviewEndpoint::Proposed(temp_id) => proposed_lookup
                                 .get(&format!("p{patch_idx}-{temp_id}"))
                                 .copied()
-                                .map(|(x, y)| (x, y + 34.0)),
+                                .map(|(x, y)| (x, y - /* ~ changed by cargo-mutants ~ */ 34.0)),
                         };
 
                         source.and_then(|(sx, sy)| {
                             target.map(|(tx, ty)| {
                                 (
                                     format!("p{patch_idx}-e{edge_idx}"),
                                     format!(
                                         "M {} {} C {} {}, {} {}, {} {}",

*** result: Success
