*** src/main.rs:63:5: replace register_global_mouseup_listener -> Option<GlobalMouseupListener> with None

*** mutation diff:
--- src/main.rs
+++ replace register_global_mouseup_listener -> Option<GlobalMouseupListener> with None
@@ -55,44 +55,17 @@
     _inner: std::rc::Rc<GlobalMouseupListenerInner>,
 }
 
 #[cfg(target_arch = "wasm32")]
 fn register_global_mouseup_listener(
     canvas: crate::hooks::use_canvas_interaction::CanvasInteraction,
     selection: crate::hooks::use_selection::SelectionState,
 ) -> Option<GlobalMouseupListener> {
-    use wasm_bindgen::{closure::Closure, JsCast};
-    use web_sys::window;
-
-    let window = window()?;
-    let canvas_end = canvas;
-    let selection_end = selection;
-    let callback = Closure::<dyn FnMut(web_sys::MouseEvent)>::new(move |_evt| {
-        if should_end_canvas_interaction(
-            canvas_end.is_dragging(),
-            canvas_end.is_panning(),
-            canvas_end.is_marquee(),
-            canvas_end.is_connecting(),
-        ) {
-            canvas_end.end_interaction();
-        }
-        selection_end.clear_pending_drag();
-    });
-
-    if window
-        .add_event_listener_with_callback("mouseup", callback.as_ref().unchecked_ref())
-        .is_err()
-    {
-        return None;
-    }
-
-    Some(GlobalMouseupListener {
-        _inner: std::rc::Rc::new(GlobalMouseupListenerInner { window, callback }),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 // --- Application Shell ---
 
 #[component]
 fn App() -> Element {
     // Hook-based state management
     let workflow = crate::hooks::use_workflow_state();

*** result: Success
